[{"courseId":"15050","treeType":"OR","nodeId":0,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Students who are interested in studying abroad should first contact the Office of International Education. More information on Study Abroad is available on OIE\u0027s Study Abroad page and at the CS Undergraduate Office.","title":"Study Abroad"},{"courseId":"15075","treeType":"OR","nodeId":1,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Students who are interested in a Co-Op experience with an external employer typically do so in their Junior year. A Co-Op is distinguished from a summer internship in that it encompasses a summer and a contiguous semester, either Spring-Summer or Summer-Fall. A list of companies who are interested in hiring Co-Op students is available from the SCS Career Consultant at the Career Center. More information on the Computer Science Co-Op program is available at the CS Undergraduate Office.","title":"Computer Science Co-Op"},{"courseId":"15090","treeType":"OR","nodeId":2,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course is for international students who are interested in working for Curricular Practical Training (CPT). Such students interested in CPT must first be authorized by the Office of International Education before being able to enroll in the Practicum course. More information on CPT is available on OIE\u0027s Foreign Student Employment page and at the CS Undergraduate Office.","title":"Computer Science Practicum"},{"courseId":"15110","treeType":"OR","nodeId":3,"isStarter":true,"prereqIndices":[],"postreqIndices":[24],"prereqLinks":[],"postreqLinks":[25],"description":"A course in fundamental computing principles for students with minimal or no computing background. Programming constructs: sequencing, selection, iteration, and recursion. Data organization: arrays and lists. Use of abstraction in computing: data representation, computer organization, computer networks, functional decomposition, and application programming interfaces. Use of computational principles in problem-solving: divide and conquer, randomness, and concurrency. Classification of computational problems based on complexity, non-computable functions, and using heuristics to find reasonable solutions to complex problems. Social, ethical and legal issues associated with the development of new computational artifacts will also be discussed.","title":"Principles of Computing"},{"courseId":"15112","treeType":"OR","nodeId":4,"isStarter":true,"prereqIndices":[],"postreqIndices":[5,6,9,19,21,24,42,53,99],"prereqLinks":[],"postreqLinks":[0,1,7,19,20,26,48,61,93],"description":"A technical introduction to the fundamentals of programming with an emphasis on producing clear, robust, and reasonably efficient code using top-down design, informal analysis, and effective testing and debugging. Starting from first principles, we will cover a large subset of the Python programming language, including its standard libraries and programming paradigms. We will also target numerous deployment scenarios, including standalone programs, shell scripts, and web-based applications. This course assumes no prior programming experience. Even so, it is a fast-paced and rigorous preparation for 15-122. Students seeking a more gentle introduction to computer science should consider first taking 15-110. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.","title":"Fundamentals of Programming and Computer Science"},{"courseId":"15121","treeType":"OR","nodeId":5,"isStarter":true,"prereqIndices":[4],"postreqIndices":[15],"prereqLinks":[0],"postreqLinks":[11],"description":"A continuation of the process of program design and analysis for students with some prior programming experience (functions, loops, and arrays, not necessarily in Java). The course reinforces object-oriented programming techniques in Java and covers data aggregates, data structures (e.g., linked lists, stacks, queues, trees, and graphs), and an introduction to the analysis of algorithms that operate on those data structures. Pre-req: 15-112 or placement","title":"Introduction to Data Structures"},{"courseId":"15122","treeType":"OR","nodeId":6,"isStarter":true,"prereqIndices":[4,7,8],"postreqIndices":[12,13,15,24,25,34,38,40,47,53,72],"prereqLinks":[1,2,3],"postreqLinks":[8,10,12,27,30,40,43,45,50,62,106],"description":"For students with a basic understanding of programming (variables, expressions, loops, arrays, functions). Teaches imperative programming and methods for ensuring the correctness of programs. Students will learn the process and concepts needed to go from high-level descriptions of algorithms to correct imperative implementations, with specific application to basic data structures and algorithms. Much of the course will be conducted in a subset of C amenable to verification, with a transition to full C near the end. This course prepares students for 15-213 and 15-210. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.","title":"Principles of Imperative Computation"},{"courseId":"15151","treeType":"OR","nodeId":7,"isStarter":true,"prereqIndices":[],"postreqIndices":[6,10,16,22],"prereqLinks":[],"postreqLinks":[2,5,15,22],"description":"","title":""},{"courseId":"21127","treeType":"OR","nodeId":8,"isStarter":true,"prereqIndices":[],"postreqIndices":[6,10,16,22,138],"prereqLinks":[],"postreqLinks":[3,4,14,21,111],"description":"","title":""},{"courseId":"15150","treeType":"OR","nodeId":9,"isStarter":true,"prereqIndices":[10,4],"postreqIndices":[12,24],"prereqLinks":[6,7],"postreqLinks":[9,28],"description":"An introduction to programming based on a \u0026quot;functional\u0026quot; model of computation. The functional model is a natural generalization of algebra in which programs are formulas that describe the output of a computation in terms of its inputs---that is, as a function. But instead of being confined to real- or complex-valued functions, the functional model extends the algebraic view to a very rich class of data types, including not only aggregates built up from other types, but also functions themselves as values. This course is an introduction to programming that is focused on the central concepts of function and type. One major theme is the interplay between inductive types, which are built up incrementally; recursive functions, which compute over inductive types by decomposition; and proof by structural induction, which is used to prove the correctness and time complexity of a recursive function. Another major theme is the role of types in structuring large programs into separate modules, and the integration of imperative programming through the introduction of data types whose values may be altered during computation. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.","title":"Principles of Functional Programming"},{"courseId":"","treeType":"OR","nodeId":10,"isStarter":true,"prereqIndices":[8,7],"postreqIndices":[9],"prereqLinks":[4,5],"postreqLinks":[6]},{"courseId":"15199","treeType":"OR","nodeId":11,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course is ONLY offered at Carnegie Mellon in Qatar. This course has the purpose of introducing first-year Computer Science students to elements of formal logic as well as to the historical context in which this discipline developed. As all subsequent courses in the CS curriculum rely on students having mastered basic logical notions and skills, it will test and enhance your preparation, thereby putting you in a better position to succeed in the program. It will also help you understand and appreciate how CS came about since Computer Science grew out of logic. The specific knowledge and skills you will learn in is course include: an enhanced ability to research topics, give presentations and write technical prose, some elementary logic, some historical depth into Computer Science, mathematics and logic itself. This course is open to Computer Science freshmen only.","title":"Special Topics: Discovering Logic"},{"courseId":"15210","treeType":"OR","nodeId":12,"isStarter":true,"prereqIndices":[6,9],"postreqIndices":[30,32,48,64],"prereqLinks":[8,9],"postreqLinks":[33,37,54,75],"description":"Teaches students about how to design, analyze, and program algorithms and data structures. The course emphasizes parallel algorithms and analysis, and how sequential algorithms can be considered a special case. The course goes into more theoretical content on algorithm analysis than 15-122 and 15-150 while still including a significant programming component and covering a variety of practical applications such as problems in data analysis, graphics, text processing, and the computational sciences. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.","title":"Parallel and Sequential Data Structures and Algorithms"},{"courseId":"15213","treeType":"OR","nodeId":13,"isStarter":true,"prereqIndices":[6],"postreqIndices":[33,44,49,51,61,62,69,75,160,166],"prereqLinks":[10],"postreqLinks":[39,49,56,60,71,72,81,88,135,145],"description":"This course provides a programmer\u0027s view of how computer systems execute programs, store information, and communicate. It enables students to become more effective programmers, especially in dealing with issues of performance, portability and robustness. It also serves as a foundation for courses on compilers, networks, operating systems, and computer architecture, where a deeper understanding of systems-level issues is required. Topics covered include: machine-level code and its generation by optimizing compilers, performance evaluation and optimization, computer arithmetic, memory organization and management, networking technology and protocols, and supporting concurrent computation. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.","title":"Introduction to Computer Systems"},{"courseId":"15214","treeType":"OR","nodeId":14,"isStarter":true,"prereqIndices":[15,16],"postreqIndices":[60,91,101,233,235],"prereqLinks":[13,16],"postreqLinks":[70,90,95,259,263],"description":"Software engineers today are less likely to design data structures and algorithms from scratch and more likely to build systems from library and framework components. In this course, students engage with concepts related to the construction of software systems at scale, building on their understanding of the basic building blocks of data structures, algorithms, program structures, and computer structures. The course covers technical topics in four areas: (1) concepts of design for complex systems, (2) object oriented programming, (3) static and dynamic analysis for programs, and (4) concurrent and distributed software. Student assignments involve engagement with complex software such as distributed massively multi-player game systems and frameworks for graphical user interaction.","title":"Principles of Software Construction: Objects, Design, and Concurrency"},{"courseId":"","treeType":"OR","nodeId":15,"isStarter":true,"prereqIndices":[5,6],"postreqIndices":[14],"prereqLinks":[11,12],"postreqLinks":[13]},{"courseId":"","treeType":"OR","nodeId":16,"isStarter":true,"prereqIndices":[8,7],"postreqIndices":[14],"prereqLinks":[14,15],"postreqLinks":[16]},{"courseId":"15221","treeType":"OR","nodeId":17,"isStarter":true,"prereqIndices":[18],"postreqIndices":[],"prereqLinks":[17],"postreqLinks":[],"description":"The course is designed for sophomore computer science majors to improve their abilities in practical, professional communications (both written and oral). It aims to help students compose clear, concise technical writings and oral presentations for multi-level audiences. Assignments include technical definitions, descriptions, instructions, process explanations, abstracts, memos, and research reports. Assignments may incorporate recent computer science research at Carnegie Mellon, projects in related technical courses, and professional case studies. Sophomores will likely find the course more useful if they have either had an internship or faculty-supervised research, including SURG projects prior to enrollment.","title":"Technical Communication for Computer Scientists"},{"courseId":"76101","treeType":"OR","nodeId":18,"isStarter":true,"prereqIndices":[],"postreqIndices":[17,23,27,28],"prereqLinks":[],"postreqLinks":[17,24,31,32],"description":"","title":""},{"courseId":"15239","treeType":"OR","nodeId":19,"isStarter":true,"prereqIndices":[20,4],"postreqIndices":[],"prereqLinks":[18,19],"postreqLinks":[],"description":"CMU has extensive global service learning opportunities promoting the advancement of social causes through technology. In this real-world project-based course, we will work closely with some of these projects to produce free and open-source software products of real and immediate value. We expect many but not all projects to include mobile web apps, though target platforms will be selected to best suit the projects we are servicing. Topics include elements of project management, design, and software development practices, tools, and techniques as required. Students will work in teams across all phases of product development, including requirements gathering, user experience design, software design, implementation, test, deployment, support, and maintenance. We aim to provide opportunities for students to interact with end-users who will directly benefit from these projects. Additional topics may include support for large-scale open-source software projects which are compatible with the goals of this course. In keeping with the goals of the course, all content created by students and faculty in this course will be released under free and open-source licenses. [Note: This course may serve as a CS Elective towards the CS major or CS minor.] Prerequisites: Permission of the instructor and either (B or higher in 15-237) OR (B or higher in 15-112 and extensive web programming experience).","title":"Special Topic: Software Development for Social Good"},{"courseId":"15237","treeType":"OR","nodeId":20,"isStarter":true,"prereqIndices":[],"postreqIndices":[19],"prereqLinks":[],"postreqLinks":[18],"description":"","title":""},{"courseId":"15251","treeType":"OR","nodeId":21,"isStarter":true,"prereqIndices":[4,22],"postreqIndices":[30,37,46,64,65],"prereqLinks":[20,23],"postreqLinks":[34,42,53,74,78],"description":"This course is about how to use theoretical ideas to formulate and solve problems in computer science. It integrates mathematical material with general problem solving techniques and computer science applications. Examples are drawn from Algorithms, Complexity Theory, Game Theory, Probability Theory, Graph Theory, Automata Theory, Algebra, Cryptography, and Combinatorics. Assignments involve both mathematical proofs and programming. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course.","title":"Great Theoretical Ideas in Computer Science"},{"courseId":"","treeType":"OR","nodeId":22,"isStarter":true,"prereqIndices":[8,7],"postreqIndices":[21],"prereqLinks":[21,22],"postreqLinks":[23]},{"courseId":"15292","treeType":"OR","nodeId":23,"isStarter":true,"prereqIndices":[18,24],"postreqIndices":[],"prereqLinks":[24,29],"postreqLinks":[],"description":"This course traces the history of computational devices, pioneers and principles from the early ages through the present. Topics include early computational devices, mechanical computation in the 19th century, events that led to electronic computing advances in the 20th century, the advent of personal computing and the Internet, and the social, legal and ethical impact of modern computational artifacts. This course also includes a history of programming languages, operating systems, processors and computing platforms. Students should have an introductory exposure to programming prior to taking this course.","title":"Special Topic: History of Computing"},{"courseId":"","treeType":"OR","nodeId":24,"isStarter":true,"prereqIndices":[3,4,6,9],"postreqIndices":[23],"prereqLinks":[25,26,27,28],"postreqLinks":[29]},{"courseId":"15295","treeType":"OR","nodeId":25,"isStarter":true,"prereqIndices":[6],"postreqIndices":[],"prereqLinks":[30],"postreqLinks":[],"description":"Each year, Carnegie Mellon fields two teams for participation in the ACM-ICPC Regional Programming Contest. During many recent years, one of those teams has earned the right to represent Carnegie Mellon at the ACM-ICPC World Finals. This course is a vehicle for those who consistently and rigorously train in preparation for the contests to earn course credit for their effort and achievement. Preparation involves the study of algorithms, the practice of programming and debugging, the development of test sets, and the growth of team, communication, and problem solving skills. Neither the course grade nor the number of units earned are dependent on ranking in any contest. Students are not required to earn course credit to participate in practices or to compete in ACM-ICPC events. Consistent, disciplined participation in team practices and associated individual preparation earns three (3) units of credit. Six (6) units of credit are possible for those who routinely complete significant homework and/or teamwork assignments outside of normal group meetings. Students interested in the course should attend during the first week of classes to discuss enrollment details.","title":"Competition Programming and Problem Solving"},{"courseId":"15296","treeType":"OR","nodeId":26,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"In this research and action based course we will explore computing from a cultural perspective. We will reflect on some issues often taken for granted e.g. are our attitudes to computing generalizable or culturally specific? How are computing and its workforce perceived and represented in US culture and in cultures from around the world? In particular we will be examining how images of the field might affect public attitudes, access to resources and understanding of computer science. Representations of the field take on particular significance in light of recent US government projections: between now and 2018, among all occupations in all fields of science and engineering, computer science occupations will account for nearly 60% of all job growth [Computing Community Consortium, 2010]. This course is aimed primarily at students who are interested in exploring some of the broad issues of computer science and its cultural context. Students will gain experience in teamwork, teaching and presenting. We will use academic papers, web sites, group discussion/debate and popular media. Findings from our investigations will inspire the action component in which student teams develop and implement a public/outreach presentation aimed at re-presenting the exciting field of computer science with broad appeal in mind.","title":"Special Topic: Images of Computing"},{"courseId":"15302","treeType":"OR","nodeId":27,"isStarter":true,"prereqIndices":[18],"postreqIndices":[],"prereqLinks":[31],"postreqLinks":[],"description":"The ultimate goal of this course is to teach students practical skills necessary to conduct effective field research on the topic of innovating for underserved communities. The course begins with an introduction to how computing technology can have a positive impact on the lives of people in developing communities and people with disabilities. Next, students will learn about the components of field research including needs assessment, literature review, iterative solution development, evaluation, and dissemination. Students will also explore the challenges of field research in this area and learn effective strategies for overcoming these challenges. Overall, students will engage in assignments and in-class exercises that help them gain experience and prepare for future field research endeavors. As part of the final assignment, students will participate in a solution design process for a specific challenge faced by one of the underserved community partners of the TechBridgeWorld research group at Carnegie Mellon University. This year, the course will focus on innovating virtual navigation tools for visually impaired adults. Promising outcomes of this course will be further developed by the TechBridgeWorld research group and tested with visually impaired users with the permission of students involved with producing these outcomes.","title":"Special Topic: Innovating for Underserved Communities: Field Research Basics"},{"courseId":"15303","treeType":"OR","nodeId":28,"isStarter":true,"prereqIndices":[18],"postreqIndices":[],"prereqLinks":[32],"postreqLinks":[],"description":"The ultimate goal of this course is to familiarize students with ongoing work in the area of technology innovations for underserved communites. This seminar course will review several key publications and presentations on this topic and teach students the necessary skills to analyze and critique this work in useful ways. Class sessions will be dedicated to discussing reading/viewing assignments and each class discussion will be led by students. Assignments will involve analyzing, writing, and presenting critiques of specific projects.","title":"Special Topic: Seminar on Innovating for Underserved Communities"},{"courseId":"15312","treeType":"OR","nodeId":29,"isStarter":true,"prereqIndices":[30,31],"postreqIndices":[50],"prereqLinks":[35,36],"postreqLinks":[58],"description":"This course discusses in depth many of the concepts underlying the design, definition, implementation, and use of modern programming languages. Formal approaches to defining the syntax and semantics are used to describe the fundamental concepts underlying programming languages. A variety of programming paradigms are covered such as imperative, functional, logic, and concurrent programming. In addition to the formal studies, experience with programming in the languages is used to illustrate how different design goals can lead to radically different languages and models of computation.","title":"Foundations of Programming Languages"},{"courseId":"","treeType":"AND","nodeId":30,"isStarter":true,"prereqIndices":[12,21],"postreqIndices":[29],"prereqLinks":[33,34],"postreqLinks":[35]},{"courseId":"15212","treeType":"OR","nodeId":31,"isStarter":true,"prereqIndices":[],"postreqIndices":[29,32],"prereqLinks":[],"postreqLinks":[36,38],"description":"","title":""},{"courseId":"15317","treeType":"OR","nodeId":32,"isStarter":true,"prereqIndices":[12,31],"postreqIndices":[50],"prereqLinks":[37,38],"postreqLinks":[59],"description":"This multidisciplinary junior-level course is designed to provide a thorough introduction to modern constructive logic, its roots in philosophy, its numerous applications in computer science, and its mathematical properties. Some of the topics to be covered are intuitionistic logic, inductive definitions, functional programming, type theory, realizability, connections between classical and constructive logic, decidable classes. This course counts as a Fundamentals course in the Computer Science major.","title":"Constructive Logic"},{"courseId":"15319","treeType":"OR","nodeId":33,"isStarter":true,"prereqIndices":[13],"postreqIndices":[],"prereqLinks":[39],"postreqLinks":[],"description":"This on-line course gives students an overview of the field of Cloud Computing, its enabling technologies, main building blocks, and hands-on experience through 4 projects utilizing a public cloud (Amazon Web Services). Cloud computing services are being adopted widely across a variety of organizations and in many domains. Simply, cloud computing is the delivery of computing as a service over a network, whereby distributed resources are rented, rather than owned, by an end user as a utility. The course will introduce this domain and cover the topics of data centers, resource management, cloud storage, and programming models. As an introduction, we will discuss the motivating factors, benefits, challenges, and service models. Modern data centers enable many of the economic and technological benefits of the cloud paradigm; hence, we will describe several concepts behind data center design and management. Next, we will focus on existing approaches for resource management including resource abstraction, sharing and virtualization technologies. Students will learn about different cloud storage concepts including data distribution, durability, consistency and redundancy. HDFS, PVFS, HBase, Cassandra and S3 will be presented as examples of underlying distributed file systems. Students will understand the details of the MapReduce programming model and gain a broad overview of alternative programming models such as Pregel, and GraphLab. Students will work with a public cloud service (such as Amazon Web Services), use it to rent and provision compute resources and then program and deploy applications that run on these resources. Students will work with cloud storage systems and learn to develop applications in the MapReduce programming paradigm.","title":"Cloud Computing"},{"courseId":"15323","treeType":"OR","nodeId":34,"isStarter":true,"prereqIndices":[6],"postreqIndices":[],"prereqLinks":[40],"postreqLinks":[],"description":"This course presents concepts and techniques for representing and manipulating discrete music information, both in real time and off line. Representations of music as explicitly timed event sequences will be introduced, and students will learn how to build efficient run-time systems for event scheduling, tempo control, and interactive processing. The MIDI protocol is used to capture real-time performance information and to generate sound. The course will also cover non-real-time processing of music data, including Markov models, style recognition, computer accompaniment, query-by-humming, and algorithmic composition. This course is independent of, and complementary to 15-322, Introduction to Computer Music, which focuses on sound synthesis and signal processing.","title":"Computer Music Systems and Information Processing"},{"courseId":"15348","treeType":"OR","nodeId":35,"isStarter":true,"prereqIndices":[36],"postreqIndices":[],"prereqLinks":[41],"postreqLinks":[],"description":"This course is ONLY offered at Carnegie Mellon in Qatar. This course covers the broad range of foundational skills that apply across all embedded computer system application areas, from thermostats to self-driving vehicles. The emphasis is at the layer where hardware meets software. Topics include microcontroller hardware, assembly language, embedded C programming, analog I/O, timers, code optimization, interrupts, and concurrency. Real world engineering practices, constraints, and example applications are integrated throughout the course. Weekly hands-on hardware and software experiences with an industry-strength automotive embedded controller are coordinated with the lecture content to reinforce core skills.","title":"Embedded Systems"},{"courseId":"15123","treeType":"OR","nodeId":36,"isStarter":true,"prereqIndices":[],"postreqIndices":[35],"prereqLinks":[],"postreqLinks":[41],"description":"","title":""},{"courseId":"15355","treeType":"OR","nodeId":37,"isStarter":true,"prereqIndices":[21],"postreqIndices":[],"prereqLinks":[42],"postreqLinks":[],"description":"The goal of this course is to investigate the relationship between algebra and computation. The course is designed to expose students to algorithms used for symbolic computation, as well as to the concepts from modern algebra which are applied to the development of these algorithms. This course provides a hands-on introduction to many of the most important ideas used in symbolic mathematical computation, which involves solving system of polynomial equations (via Groebner bases), analytic integration, and solving linear difference equations. Throughout the course the computer algebra system Mathematica will be used for computation.","title":"Modern Computer Algebra"},{"courseId":"15381","treeType":"OR","nodeId":38,"isStarter":true,"prereqIndices":[6,39],"postreqIndices":[],"prereqLinks":[43,44],"postreqLinks":[],"description":"This course is about the theory and practice of Artificial Intelligence. We will study modern techniques for computers to represent task-relevant information and make intelligent (i.e. satisficing or optimal) decisions towards the achievement of goals. The search and problem solving methods are applicable throughout a large range of industrial, civil, medical, financial, robotic, and information systems. We will investigate questions about AI systems such as: how to represent knowledge, how to effectively generate appropriate sequences of actions and how to search among alternatives to find optimal or near-optimal solutions. We will also explore how to deal with uncertainty in the world, how to learn from experience, and how to learn decision rules from data. We expect that by the end of the course students will have a thorough understanding of the algorithmic foundations of AI, how probability and AI are closely interrelated, and how automated agents learn. We also expect students to acquire a strong appreciation of the big-picture aspects of developing fully autonomous intelligent agents. Other lectures will introduce additional aspects of AI, including natural language processing, web-based search engines, industrial applications, autonomous robotics, and economic/game-theoretic decision making.","title":"Artificial Intelligence: Representation and Problem Solving"},{"courseId":"15211","treeType":"OR","nodeId":39,"isStarter":true,"prereqIndices":[],"postreqIndices":[38,47,49],"prereqLinks":[],"postreqLinks":[44,51,55],"description":"","title":""},{"courseId":"15385","treeType":"OR","nodeId":40,"isStarter":true,"prereqIndices":[6,41],"postreqIndices":[],"prereqLinks":[45,46],"postreqLinks":[],"description":"An introduction to the science and engineering of computer vision, i.e. the analysis of the patterns in visual images with the view to understanding the objects and processes in the world that generate them. Major topics include image formation and sensing, fourier analysis, edge and contour detection, inference of depth, shape and motion, classification, recognition, tracking, and active vision. The emphasis is on the learning of fundamental mathematical concepts and techniques and applying them to solve real vision problems. The discussion will also include comparison with human and animal vision from psychological and biological perspectives. Students will learn to think mathematically and develop skills in translating ideas and mathematical thoughts into programs to solve real vision problems.","title":"Introduction to Computer Vision"},{"courseId":"21241","treeType":"OR","nodeId":41,"isStarter":true,"prereqIndices":[],"postreqIndices":[40,64,69],"prereqLinks":[],"postreqLinks":[46,76,82],"description":"","title":""},{"courseId":"15386","treeType":"OR","nodeId":42,"isStarter":true,"prereqIndices":[43,4],"postreqIndices":[],"prereqLinks":[47,48],"postreqLinks":[],"description":"Computational neuroscience is an interdisciplinary science that seeks to understand how the brain computes to achieve natural intelligence. It seeks to understand the computational principles and mechanisms of intelligent behaviors and mental abilities -- such as perception, language, motor control, and learning -- by building artificial systems and computational models with the same capabilities. This course explores how neurons encode and process information, adapt and learn, communicate, cooperate, compete and compute at the individual level as well as at the levels of networks and systems. It will introduce basic concepts in computational modeling, information theory, signal processing, system analysis, statistical and probabilistic inference. Concrete examples will be drawn from the visual system and the motor systems, and studied from computational, psychological and biological perspectives. Students will learn to perform computational experiments using Matlab and quantitative studies of neurons and neuronal networks.","title":"Neural Computation"},{"courseId":"21122","treeType":"OR","nodeId":43,"isStarter":true,"prereqIndices":[],"postreqIndices":[42,99,73,151],"prereqLinks":[],"postreqLinks":[47,94,103,126],"description":"","title":""},{"courseId":"15410","treeType":"OR","nodeId":44,"isStarter":true,"prereqIndices":[13],"postreqIndices":[63,84,185,227,242,249],"prereqLinks":[49],"postreqLinks":[73,89,187,252,271,282],"description":"Operating System Design and Implementation is a rigorous hands-on introduction to the principles and practice of operating systems. The core experience is writing a small Unix-inspired OS kernel, in C with some x86 assembly language, which runs on a PC hardware simulator (and on actual PC hardware if you wish). Work is done in two-person teams, and \u0026quot;team programming\u0026quot; skills (source control, modularity, documentation) are emphasized. The size and scope of the programming assignments typically result in students significantly developing their design, implementation, and debugging abilities. Core concepts include the process model, virtual memory, threads, synchronization, and deadlock; the course also surveys higher-level OS topics including file systems, interprocess communication, networking, and security. Students, especially graduate students, who have not satisfied the prerequisite at Carnegie Mellon are strongly cautioned - to enter the class you must be able to write a storage allocator in C, use a debugger, understand 2\u0027s-complement arithmetic, and translate between C and x86 assembly language. The instructor may require you to complete a skills assessment exercise before the first week of the semester in order to remain registered in the class. Auditing: this course is usually full, and we generally receive many more requests to audit than we can accept. If you wish to audit, please have your advisor contact us before the semester begins to discuss your educational goals.","title":"Operating System Design and Implementation"},{"courseId":"15413","treeType":"OR","nodeId":45,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"In this course, students will carry out a semester-long software development project for a real client. Students will have the choice of a client at CMU, or a client who is part of an open-source development project. Students who choose the open-source option will have the opportunity to collaborate with students at other universities such as Stanford or MIT, and will participate in a kickoff meeting sponsored by Facebook, February 7-9 in Menlo Park, CA. Students in the open-source option should sign up for the course and notify the instructors of their interest by November 22, 2013. A few lectures at the beginning of the course will introduce the process, tools, and documents to be used in the course, all of which will be specified by the instructors. Throughout the project, groups will be mentored through weekly team meetings with faculty. Students will make regular presentations, and will be evaluated on the code delivered, software engineering process, client satisfaction, and their contribution to the team. Students will leave the course with a firsthand understanding of the software engineering realities that drive SE practices. They will have concrete experience with these practices, and will have engaged in active reflection on this experience. They will have teamwork, process, and product skills to support immediate competency in a software engineering organization, along with a deeper understanding that prepares them to evaluate the new processes and techniques they will encounter in the workplace.","title":"Software Engineering Practicum"},{"courseId":"15414","treeType":"OR","nodeId":46,"isStarter":true,"prereqIndices":[47,21],"postreqIndices":[],"prereqLinks":[52,53],"postreqLinks":[],"description":"Many CS and ECE students will be developing software and hardware that must be ultra reliable at some point in their careers. Logical errors in such designs can be costly, even life threatening. There have already been a number of well publicized errors like the Intel Pentium floating point error and the Arian 5 crash. In this course we will study tools for finding and preventing logical errors. Three types of tools will be studied: automated theorem proving, state exploration techniques like model checking and tools based on static program analysis. Although students will learn the theoretical basis for such tools, the emphasis will be on actually using them on real examples. This course can be used to satisfy the Logic \u0026amp; Languages requirement for the Computer Science major.","title":"Bug Catching: Automated Program Verification and Testing"},{"courseId":"","treeType":"OR","nodeId":47,"isStarter":true,"prereqIndices":[6,39],"postreqIndices":[46],"prereqLinks":[50,51],"postreqLinks":[52]},{"courseId":"15415","treeType":"OR","nodeId":48,"isStarter":true,"prereqIndices":[12,49],"postreqIndices":[],"prereqLinks":[54,57],"postreqLinks":[],"description":"This course covers the fundamental topics for Database Management Systems: Database System Architectural Principles (ACID properties; data abstraction; external, conceptual, and internal schemata; data independence; data definition and data manipulation languages), Data models (entity-relationship and relational data models; data structures, integrity constraints, and operations for each data model; relational query languages: SQL, algebra, calculus), Theory of database design (functional dependencies; normal forms; dependency preservation; information loss), Query Optimization (equivalence of expressions, algebraic manipulation; optimization of selections and joins), Storage Strategies (indices, B-trees, hashing), Query Processing (execution of sort, join, and aggregation operators), and Transaction Processing (recovery and concurrency control).","title":"Database Applications"},{"courseId":"","treeType":"AND","nodeId":49,"isStarter":true,"prereqIndices":[39,13],"postreqIndices":[48],"prereqLinks":[55,56],"postreqLinks":[57]},{"courseId":"15417","treeType":"OR","nodeId":50,"isStarter":true,"prereqIndices":[29,32],"postreqIndices":[],"prereqLinks":[58,59],"postreqLinks":[],"description":"The course covers the implementation of compilers for higher-order, typed languages such as ML and Haskell, and gives an introduction to type-preserving compilation. Topics covered include type inference, elaboration, CPS conversion, closure conversion, garbage collection, phase splitting, and typed assembly language.","title":"HOT Compilation"},{"courseId":"15418","treeType":"OR","nodeId":51,"isStarter":true,"prereqIndices":[13],"postreqIndices":[],"prereqLinks":[60],"postreqLinks":[],"description":"The fundamental principles and engineering tradeoffs involved in designing modern parallel computers, as well as the programming techniques to effectively utilize these machines. Topics include naming shared data, synchronizing threads, and the latency and bandwidth associated with communication. Case studies on shared-memory, message-passing, data-parallel and dataflow machines will be used to illustrate these techniques and tradeoffs. Programming assignments will be performed on one or more commercial multiprocessors, and there will be a significant course project.","title":"Parallel Computer Architecture and Programming"},{"courseId":"15423","treeType":"OR","nodeId":52,"isStarter":true,"prereqIndices":[53,54],"postreqIndices":[],"prereqLinks":[63,69],"postreqLinks":[],"description":"Digital signals comprise a large fraction of the data analyzed by computer scientists. Sound, e.g. speech and music, images, radar and many other signal types that were conventionally considered to be the domain of the Electrical engineer are now also in the domain of computer scientists, who must analyze them, make inferences, and develop machine learning techinques to analyze, classify and reconstruct such data. In this course we will cover the basics of Digital Signal Processing. We will concentrate on the basic mathematical formulations, rather than in-depth implementation details. We will cover the breadth of topics, beginning with the basics of signals and their representations, the theory of sampling, important transform representations, key processing techniques, and spectral estimation.","title":"Special Topic: Digital Signal Processing for Computer Science"},{"courseId":"","treeType":"OR","nodeId":53,"isStarter":true,"prereqIndices":[4,6],"postreqIndices":[52],"prereqLinks":[61,62],"postreqLinks":[63]},{"courseId":"","treeType":"OR","nodeId":54,"isStarter":true,"prereqIndices":[55,56,57,58,59],"postreqIndices":[52],"prereqLinks":[64,65,66,67,68],"postreqLinks":[69]},{"courseId":"21325","treeType":"OR","nodeId":55,"isStarter":true,"prereqIndices":[],"postreqIndices":[54],"prereqLinks":[],"postreqLinks":[64],"description":"","title":""},{"courseId":"36625","treeType":"OR","nodeId":56,"isStarter":true,"prereqIndices":[],"postreqIndices":[54],"prereqLinks":[],"postreqLinks":[65],"description":"","title":""},{"courseId":"36217","treeType":"OR","nodeId":57,"isStarter":true,"prereqIndices":[],"postreqIndices":[54,144,230],"prereqLinks":[],"postreqLinks":[66,116,254],"description":"","title":""},{"courseId":"36225","treeType":"OR","nodeId":58,"isStarter":true,"prereqIndices":[],"postreqIndices":[54],"prereqLinks":[],"postreqLinks":[67],"description":"","title":""},{"courseId":"15359","treeType":"OR","nodeId":59,"isStarter":true,"prereqIndices":[],"postreqIndices":[54],"prereqLinks":[],"postreqLinks":[68],"description":"","title":""},{"courseId":"15437","treeType":"OR","nodeId":60,"isStarter":true,"prereqIndices":[14],"postreqIndices":[],"prereqLinks":[70],"postreqLinks":[],"description":"This course will introduce concepts in programming web application servers. We will study the fundamental architectural elements of programming web sites that produce content dynamically. The primary technologies introduced will by the Spring Framework for Java and the Django framework for Python, but we will cover related topics as necessary so that students can build significant applications. Such topics include: HTTP, HTML, CSS, Javascript, XML, Design Patterns, Relational and Non-relational Databases, Object-Relation Mapping tools, Security, Web Services, Cloud Deployment, Internationalization, and Scalability and Performance Issues. Students must be comfortable programming in Java and/or Python to register for this course. Students must provide their own computer hardware for this course. Please see the Related URL above for more information.","title":"Web Application Development"},{"courseId":"15440","treeType":"OR","nodeId":61,"isStarter":true,"prereqIndices":[13],"postreqIndices":[],"prereqLinks":[71],"postreqLinks":[],"description":"The goals of this course are twofold: First, for students to gain an understanding of the principles and techniques behind the design of distributed systems, such as locking, concurrency, scheduling, and communication across the network. Second, for students to gain practical experience designing, implementing, and debugging real distributed systems. The major themes this course will teach include scarcity, scheduling, concurrency and concurrent programming, naming, abstraction and modularity, imperfect communication and other types of failure, protection from accidental and malicious harm, optimism, and the use of instrumentation and monitoring and debugging tools in problem solving. As the creation and management of software systems is a fundamental goal of any undergraduate systems course, students will design, implement, and debug large programming projects. As a consequence, competency in both the C and Java programming languages is required.","title":"Distributed Systems"},{"courseId":"15441","treeType":"OR","nodeId":62,"isStarter":true,"prereqIndices":[13],"postreqIndices":[232],"prereqLinks":[72],"postreqLinks":[255],"description":"The emphasis in this course will be on the basic performance and engineering trade-offs in the design and implementation of computer networks. To make the issues more concrete, the class includes several multi-week projects requiring significant design and implementation. The goal is for students to learn not only what computer networks are and how they work today, but also why they are designed the way they are and how they are likely to evolve in the future. We will draw examples primarily from the Internet. Topics to be covered include: network architecture, routing, congestion/flow/error control, naming and addressing, peer-to-peer and the web, internetworking, and network security.","title":"Computer Networks"},{"courseId":"15449","treeType":"OR","nodeId":63,"isStarter":true,"prereqIndices":[44],"postreqIndices":[],"prereqLinks":[73],"postreqLinks":[],"description":"This is a course for students with strong design and implementation skills who are likely to pursue careers as software architects and lead engineers. It may be taken by well-prepared undergraduates with excellent design and implementation skills in low-level systems programing. The course assumes a high level of proficiency in all aspects of operating system design and implementation. This course will help students prepare for leadership roles in creating and evolving the complex, large-scale computer systems that society will increasingly depend on in the future. The course will teach the organizing principles of such systems, identifying a core set of versatile techniques that are applicable across many system layers. Students will acquire the knowledge base, intellectual tools, hands-on skills and modes of thought needed to build well-engineered computer systems that withstand the test of time, growth in scale, and stresses of live use. Topics covered include: caching, prefetching, damage containment, scale reduction, hints, replication, hash-based techniques, and fragmentation reduction. A substantial project component is an integral part of the course. A high level of proficiency in systems programming is expected. If you do not have the 15-410 prerequisite you will need to get approval from the faculty.","title":"Engineering Distributed Systems"},{"courseId":"15451","treeType":"OR","nodeId":64,"isStarter":true,"prereqIndices":[21,12,41],"postreqIndices":[67],"prereqLinks":[74,75,76],"postreqLinks":[79],"description":"This course is about the design and analysis of algorithms. We study specific algorithms for a variety of problems, as well as general design and analysis techniques. Specific topics include searching, sorting, algorithms for graph problems, efficient data structures, lower bounds and NP-completeness. A variety of other topics may be covered at the discretion of the instructor. These include parallel algorithms, randomized algorithms, geometric algorithms, low level techniques for efficient programming, cryptography, and cryptographic protocols.","title":"Algorithm Design and Analysis"},{"courseId":"15453","treeType":"OR","nodeId":65,"isStarter":true,"prereqIndices":[66,21],"postreqIndices":[],"prereqLinks":[77,78],"postreqLinks":[],"description":"An introduction to the fundamental ideas and models underlying computing: finite automata, regular sets, pushdown automata, context-free grammars, Turing machines, undecidability, and complexity theory.","title":"Formal Languages, Automata, and Computability"},{"courseId":"21228","treeType":"OR","nodeId":66,"isStarter":true,"prereqIndices":[],"postreqIndices":[65],"prereqLinks":[],"postreqLinks":[77],"description":"","title":""},{"courseId":"15456","treeType":"OR","nodeId":67,"isStarter":true,"prereqIndices":[64],"postreqIndices":[],"prereqLinks":[79],"postreqLinks":[],"description":"How do you sort points in space? What does it even mean? This course takes the ideas of a traditional algorithms course, sorting, searching, selecting, graphs, and optimization, and extends them to problems on geometric inputs. We will cover many classical geometric constructions and novel algorithmic methods. Some of the topics to be covered are convex hulls, Delaunay triangulations, graph drawing, point location, geometric medians, polytopes, configuration spaces, linear programming, and others. This course is a natural extension to 15-451, for those who want to learn about algorithmic problems in higher dimensions.","title":"Special Topic: Computational Geometry"},{"courseId":"15462","treeType":"OR","nodeId":68,"isStarter":true,"prereqIndices":[69,71],"postreqIndices":[74],"prereqLinks":[83,86],"postreqLinks":[87],"description":"This course provides a comprehensive introduction to computer graphics modeling, animation, and rendering. Topics covered include basic image processing, geometric transformations, geometric modeling of curves and surfaces, animation, 3-D viewing, visibility algorithms, shading, and ray tracing.","title":"Computer Graphics"},{"courseId":"","treeType":"AND","nodeId":69,"isStarter":true,"prereqIndices":[70,13,41],"postreqIndices":[68],"prereqLinks":[80,81,82],"postreqLinks":[83]},{"courseId":"21259","treeType":"OR","nodeId":70,"isStarter":true,"prereqIndices":[],"postreqIndices":[69,151],"prereqLinks":[],"postreqLinks":[80,127],"description":"","title":""},{"courseId":"","treeType":"AND","nodeId":71,"isStarter":true,"prereqIndices":[72,73],"postreqIndices":[68],"prereqLinks":[84,85],"postreqLinks":[86]},{"courseId":"18213","treeType":"OR","nodeId":72,"isStarter":true,"prereqIndices":[6],"postreqIndices":[71,143,147,160,226,250],"prereqLinks":[106],"postreqLinks":[84,120,122,136,249,283],"description":"This course provides a programmer\u0027s view of how computer systems execute programs, store information, and communicate. It enables students to become more effective programmers, especially in dealing with issues of performance, portability and robustness. It also serves as a foundation for courses on compilers, networks, operating systems, and computer architecture, where a deeper understanding of systems-level issues is required. Topics covered include: machine-level code and its generation by optimizing compilers, performance evaluation and optimization, computer arithmetic, memory organization and management, networking technology and protocols, and supporting concurrent computation. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course. Prerequisites: 15-123 (Grade of C or higher is required in the prerequisite)","title":"Introduction to Computer Systems"},{"courseId":"18202","treeType":"OR","nodeId":73,"isStarter":true,"prereqIndices":[43,133,134],"postreqIndices":[71,135,139],"prereqLinks":[103,104,105],"postreqLinks":[85,108,113],"description":"This course covers topics from engineering mathematics that serve as foundations for descriptions of electrical engineering devices and systems. It is the corequisite mathematics course for 18-220, Fundamentals of Electrical Engineering. The topics include: (1) MATLAB as a robust computational tool, used to reinforce, enrich and integrate ideas throughout the course, including software exercises and projects in combination with homework assignments, (2) Complex Analysis, including rectangular and polar representations in the complex plane with associated forms of complex arithmetic, powers, roots and complex logarithms, complex differentiation, analytic functions and Cauchy-Riemann equations, complex Taylor series, complex exponential, sinusoidal and hyperbolic functions, and Euler\u0027s formula, (3) Fourier Analysis, including orthogonality of sinusoids, trigonometric and exponential forms of Fourier series, Fourier integrals and Fourier transforms, (4) Linear, Constant-Coefficient Differential Equations, including complex exponential solutions to homogeneous equations and particular solutions with polynomial and sinusoidal driving functions described by phasors, (5) Difference Equations, with emphasis upon their relationship to differential equations, and (6) Linear Algebra and Matrices, including matrix arithmetic, linear systems of equations and Gaussian elimination, vector spaces and rank of matrices, matrix inverses and determinants, eigenvalue problems and their relationship to systems of homogeneous differential equations. 4 hrs. lec., 1hr. rec.","title":"Mathematical Foundations of Electrical Engineering"},{"courseId":"15465","treeType":"OR","nodeId":74,"isStarter":true,"prereqIndices":[68],"postreqIndices":[],"prereqLinks":[87],"postreqLinks":[],"description":"Animation Art and Technology is an interdisciplinary course cross-listed between Art and Computer Science. Faculty and teaching assistants from computer science and art teach the class as a team. It is a project-based course in which four to five interdisciplinary teams of students produce animations. Most of the animations have a substantive technical component and the students are challenged to consider innovation with content to be equal with the technical. The class includes basic tutorials for work in Maya leading toward more advanced applications and extensions of the software such as motion capture and algorithms for animating cloth, hair, particles, and grouping behaviors. The first class will meet in CFA room 303.","title":"Animation Art and Technology"},{"courseId":"15494","treeType":"OR","nodeId":75,"isStarter":true,"prereqIndices":[13],"postreqIndices":[],"prereqLinks":[88],"postreqLinks":[],"description":"Cognitive robotics is a new approach to robot programming based on high level primitives for perception and action. These primitives draw inspiration from ideas in cognitive science combined with state of the art robotics algorithms. Students will experiment with these primitives and help develop new ones using the Tekkotsu software framework on the Calliope robot, which includes a 5 degree-of-freedom arm with gripper, a Kinect camera on a pan/tilt mount, and Ubuntu Linux on a dual-core on-board netbook. Prior robotics experience is not necessary, but strong programming skills are required.","title":"Special Topic: Cognitive Robotics"},{"courseId":"15591","treeType":"OR","nodeId":76,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"To be determined","title":"Independent Study in Computer Science"},{"courseId":"15592","treeType":"OR","nodeId":77,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"to be determined","title":"Independent Study in Computer Science"},{"courseId":"15593","treeType":"OR","nodeId":78,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"To be determined","title":"Independent Study in Computer Science"},{"courseId":"15594","treeType":"OR","nodeId":79,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"to be determined","title":"Independent Study in Computer Science"},{"courseId":"15599","treeType":"OR","nodeId":80,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Available only to students registered in the CS Senior Research Thesis Program.","title":"Undergraduate Thesis Research"},{"courseId":"15602","treeType":"OR","nodeId":81,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The ultimate goal of this course is to teach students practical skills necessary to conduct effective field research on the topic of innovating for underserved communities. The course begins with an introduction to how computing technology can have a positive impact on the lives of people in developing communities and people with disabilities. Next, students will learn about the components of field research including needs assessment, literature review, iterative solution development, evaluation, and dissemination. Students will also explore the challenges of field research in this area and learn effective strategies for overcoming these challenges. Overall, students will engage in assignments and in-class exercises that help them gain experience and prepare for future field research endeavors. As part of the final assignment, students will participate in a solution design process for a specific challenge faced by one of the underserved community partners of the TechBridgeWorld research group at Carnegie Mellon University. This year, the course will focus on innovating virtual navigation tools for visually impaired adults. Promising outcomes of this course will be further developed by the TechBridgeWorld research group and tested with visually impaired users with the permission of students involved with producing these outcomes.","title":"Special Topic :Innovating for Underserved Communities: Field Research Basics"},{"courseId":"15603","treeType":"OR","nodeId":82,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The ultimate goal of this course is to familiarize students with ongoing work in the area of technology innovations for underserved communities. This seminar course will review several key publications and presentations on this topic and teach students the necessary skills to analyze and critique this work in useful ways. Class sessions will be dedicated to discussing reading/viewing assignments and each class discussion will be led by students. Assignments will involve analyzing, writing, and presenting critiques of specific projects.","title":"Special Topics: Seminar on Innovating for Underserved Communities"},{"courseId":"15605","treeType":"OR","nodeId":83,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Operating System Design and Implementation is a rigorous hands-on introduction to the principles and practice of operating systems. The core experience is writing a small Unix-inspired OS kernel, in C with some x86 assembly language, which runs on a PC hardware simulator (and on actual PC hardware if you wish). Work is done in two-person teams, and \u0026quot;team programming\u0026quot; skills (source control, modularity, documentation) are emphasized. The size and scope of the programming assignments typically result in students significantly developing their design, implementation, and debugging abilities. Core concepts include the process model, virtual memory, threads, synchronization, and deadlock; the course also surveys higher-level OS topics including file systems, interprocess communication, networking, and security. Students, especially graduate students, who have not satisfied the prerequisite at Carnegie Mellon are strongly cautioned - to enter the class you must be able to write a storage allocator in C, use a debugger, understand 2\u0027s-complement arithmetic, and translate between C and x86 assembly language. The instructor may require you to complete a skills assessment exercise before the first week of the semester in order to remain registered in the class. Auditing: this course is usually full, and we generally receive many more requests to audit than we can accept. If you wish to audit, please have your advisor contact us before the semester begins to discuss your educational goals.","title":"Operating System Design and Implementaion"},{"courseId":"15610","treeType":"OR","nodeId":84,"isStarter":true,"prereqIndices":[44],"postreqIndices":[],"prereqLinks":[89],"postreqLinks":[],"description":"This is a master\u0027s level course for students with strong design and implementation skills who are likely to pursue careers as software architects and lead engineers. It may be taken by well-prepared undergraduates with excellent design and implementation skills in low-level systems programing. The course assumes a high level of proficiency in all aspects of operating system design and implementation. This course will help students prepare for leadership roles in creating and evolving the complex, large-scale computer systems that society will increasingly depend on in the future. The course will teach the organizing principles of such systems, identifying a core set of versatile techniques that are applicable across many system layers. Students will acquire the knowledge base, intellectual tools, hands-on skills and modes of thought needed to build well-engineered computer systems that withstand the test of time, growth in scale, and stresses of live use. Topics covered include: caching, prefetching, damage containment, scale reduction, hints, replication, hash-based techniques, and fragmentation reduction. A substantial project component is an integral part of the course. A high level of proficiency in systems programming is expected.","title":"Engineering Distributed Systems"},{"courseId":"15614","treeType":"OR","nodeId":85,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Many CS and ECE students will be developing software and hardware that must be ultra reliable at some point in their careers. Logical errors in such designs can be costly, even life threatening. There have already been a number of well publicized errors like the Intel Pentium floating point error and the Arian 5 crash. In this course we will study tools for finding and preventing logical errors. Three types of tools will be studied: automated theorem proving, state exploration techniques like model checking and tools based on static program analysis. Although students will learn the theoretical basis for such tools, the emphasis will be on actually using them on real examples. This course can be used to satisfy the Logic \u0026amp; Languages requirement for the Computer Science major.","title":"Bug Catching: Automated Program Verification and Testing"},{"courseId":"15615","treeType":"OR","nodeId":86,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course covers the fundamental topics for Database Management Systems: Database System Architectural Principles (ACID properties; data abstraction; external, conceptual, and internal schemata; data independence; data definition and data manipulation languages), Data models (entity-relationship and relational data models; data structures, integrity constraints, and operations for each data model; relational query languages: SQL, algebra, calculus), Theory of database design (functional dependencies; normal forms; dependency preservation; information loss), Query Optimization (equivalence of expressions, algebraic manipulation; optimization of selections and joins), Storage Strategies (indices, B-trees, hashing), Query Processing (execution of sort, join, and aggregation operators), and Transaction Processing (recovery and concurrency control).","title":"Database Applications"},{"courseId":"15617","treeType":"OR","nodeId":87,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The course covers the implementation of compilers for higher-order, typed languages such as ML and Haskell, and gives an introduction to type-preserving compilation. Topics covered include type inference, elaboration, CPS conversion, closure conversion, garbage collection, phase splitting, and typed assembly language.","title":"Hot Compilation"},{"courseId":"15618","treeType":"OR","nodeId":88,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The fundamental principles and engineering tradeoffs involved in designing modern parallel computers, as well as the programming techniques to effectively utilize these machines. Topics include naming shared data, synchronizing threads, and the latency and bandwidth associated with communication. Case studies on shared-memory, message-passing, data-parallel and dataflow machines will be used to illustrate these techniques and tradeoffs. Programming assignments will be performed on one or more commercial multiprocessors, and there will be a significant course project.","title":"Parallel Computer Architecture and Programming"},{"courseId":"15619","treeType":"OR","nodeId":89,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This on-line course gives students an overview of the field of Cloud Computing, its enabling technologies, main building blocks, and hands-on experience through 4 projects utilizing a public cloud (Amazon Web Services). Cloud computing services are being adopted widely across a variety of organizations and in many domains. Simply, cloud computing is the delivery of computing as a service over a network, whereby distributed resources are rented, rather than owned, by an end user as a utility. The course will introduce this domain and cover the topics of data centers, resource management, cloud storage, and programming models. As an introduction, we will discuss the motivating factors, benefits, challenges, and service models. Modern data centers enable many of the economic and technological benefits of the cloud paradigm; hence, we will describe several concepts behind data center design and management. Next, we will focus on existing approaches for resource management including resource abstraction, sharing and virtualization technologies. Students will learn about different cloud storage concepts including data distribution, durability, consistency and redundancy. HDFS, PVFS, HBase, Cassandra and S3 will be presented as examples of underlying distributed file systems. Students will understand the details of the MapReduce programming model and gain a broad overview of alternative programming models such as Pregel, and GraphLab. Students will work with a public cloud service (such as Amazon Web Services), use it to rent and provision compute resources and then program and deploy applications that run on these resources. Students will work with cloud storage systems and learn to develop applications in the MapReduce programming paradigm.","title":"Cloud Computing"},{"courseId":"15623","treeType":"OR","nodeId":90,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Digital signals comprise a large fraction of the data analyzed by computer scientists. Sound, e.g. speech and music, images, radar and many other signal types that were conventionally considered to be the domain of the Electrical engineer are now also in the domain of computer scientists, who must analyze them, make inferences, and develop machine learning techinques to analyze, classify and reconstruct such data. In this course we will cover the basics of Digital Signal Processing. We will concentrate on the basic mathematical formulations, rather than in-depth implementation details. We will cover the breadth of topics, beginning with the basics of signals and their representations, the theory of sampling, important transform representations, key processing techniques, and spectral estimation.","title":"Special Topic: Digital Signal Processing for Computer Science"},{"courseId":"15637","treeType":"OR","nodeId":91,"isStarter":true,"prereqIndices":[14],"postreqIndices":[],"prereqLinks":[90],"postreqLinks":[],"description":"This course will introduce concepts in programming web application servers. We will study the fundamental architectural elements of programming web sites that produce content dynamically. The primary technologies introduced will by the Spring Framework for Java and the Django framework for Python, but we will cover related topics as necessary so that students can build significant applications. Such topics include: HTTP, HTML, CSS, Javascript, XML, Design Patterns, Relational and Non-relational Databases, Object-Relation Mapping tools, Security, Web Services, Cloud Deployment, Internationalization, and Scalability and Performance Issues. Students must be comfortable programming in Java and/or Python to register for this course. Students must provide their own computer hardware for this course. Please see the Related URL above for more information.","title":"Web Application Development"},{"courseId":"15640","treeType":"OR","nodeId":92,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The goals of this course are twofold: First, for students to gain an understanding of the principles and techniques behind the design of distributed systems, such as locking, concurrency, scheduling, and communication across the network. Second, for students to gain practical experience designing, implementing, and debugging real distributed systems. The major themes this course will teach include scarcity, scheduling, concurrency and concurrent programming, naming, abstraction and modularity, imperfect communication and other types of failure, protection from accidental and malicious harm, optimism, and the use of instrumentation and monitoring and debugging tools in problem solving. As the creation and management of software systems is a fundamental goal of any undergraduate systems course, students will design, implement, and debug large programming projects. As a consequence, competency in both the C and Java programming languages is required.","title":"Distributed Systems"},{"courseId":"15648","treeType":"OR","nodeId":93,"isStarter":true,"prereqIndices":[94],"postreqIndices":[94],"prereqLinks":[91],"postreqLinks":[92],"description":"Advancing the state of the art in large scale systems is challenging for many reasons including algorithm efficiency, weak consistency, failure tolerance, etc. However, as observed repeatedly among the Googles, Facebooks and Yahoo!\u0027s, all the rest of these hardly matter if the developer is not experienced with large systems, if the logistics of large scale systems are not easily mastered, and if the large collection of core systems is unfamiliar. Without good hands on experience with the current systems and their tools, theoretical knowledge leads to theoretical success, and too often little more. This course is a project course intended primarily for the Big Data Systems track of the Very Large Informations Systems program. Others need instructor approval to register.","title":"Studio in Big Data Systems"},{"courseId":"15649","treeType":"OR","nodeId":94,"isStarter":true,"prereqIndices":[93],"postreqIndices":[93],"prereqLinks":[92],"postreqLinks":[91],"description":"This three unit seminar is intended primarily for the Big Data Systems track of the Very Large Informations Systems program. The content of the seminar will be the integration of the material in the courses and projects on this program; how everything fits into the computing world today, and whatever else is missing from the rest of the program. Most meetings will be informal discussions with the program leadership, some guest speakers, and some little reading. Students not registered in the Big Data Systems track of the Very Large Informations Systems program need instructor approval to register for this seminar. Co-requisite: 15-648","title":"Seminar Data Systems"},{"courseId":"15651","treeType":"OR","nodeId":95,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course is about the design and analysis of algorithms. We study specific algorithms for a variety of problems, as well as general design and analysis techniques. Specific topics include searching, sorting, algorithms for graph problems, efficient data structures, lower bounds and NP-completeness. A variety of other topics may be covered at the discretion of the instructor. These include parallel algorithms, randomized algorithms, geometric algorithms, low level techniques for efficient programming, cryptography, and cryptographic protocols.","title":"Algorithm Design and Analysis"},{"courseId":"15652","treeType":"OR","nodeId":96,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course discusses in depth many of the concepts underlying the design, definition, implementation, and use of modern programming languages. Formal approaches to defining the syntax and semantics are used to describe the fundamental concepts underlying programming languages. A variety of programming paradigms are covered such as imperative, functional, logic, and concurrent programming. In addition to the formal studies, experience with programming in the languages is used to illustrate how different design goals can lead to radically different languages and models of computation.","title":"Foundation Programming Languages"},{"courseId":"15662","treeType":"OR","nodeId":97,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course provides a comprehensive introduction to computer graphics modeling, animation, and rendering. Topics covered include basic image processing, geometric transformations, geometric modeling of curves and surfaces, animation, 3-D viewing, visibility algorithms, shading, and ray tracing.","title":"Computer Graphics"},{"courseId":"15669","treeType":"OR","nodeId":98,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Masters Research"},{"courseId":"15686","treeType":"OR","nodeId":99,"isStarter":true,"prereqIndices":[4,43],"postreqIndices":[],"prereqLinks":[93,94],"postreqLinks":[],"description":"Computational neuroscience is an interdisciplinary science that seeks to understand how the brain computes to achieve natural intelligence. It seeks to understand the computational principles and mechanisms of intelligent behaviors and mental abilities -- such as perception, language, motor control, and learning -- by building artificial systems and computational models with the same capabilities. This course explores how neurons encode and process information, adapt and learn, communicate, cooperate, compete and compute at the individual level as well as at the levels of networks and systems. It will introduce basic concepts in computational modeling, information theory, signal processing, system analysis, statistical and probabilistic inference. Concrete examples will be drawn from the visual system and the motor systems, and studied from computational, psychological and biological perspectives. Students will learn to perform computational experiments using Matlab and quantitative studies of neurons and neuronal networks.","title":"Neural Computation"},{"courseId":"15689","treeType":"OR","nodeId":100,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Independent Study in the Computer Sciences"},{"courseId":"15694","treeType":"OR","nodeId":101,"isStarter":true,"prereqIndices":[14],"postreqIndices":[],"prereqLinks":[95],"postreqLinks":[],"description":"Cognitive robotics is a new approach to robot programming based on high level primitives for perception and action. These primitives draw inspiration from ideas in cognitive science combined with state of the art robotics algorithms. Students will experiment with these primitives and help develop new ones using the Tekkotsu software framework on the Calliope robot, which includes a 5 degree-of-freedom arm with gripper, a Kinect camera on a pan/tilt mount, and Ubuntu Linux on a dual-core on-board netbook. Prior robotics experience is not necessary, but strong programming skills are required.","title":"Special Topic: Cognitive Robotics"},{"courseId":"15697","treeType":"OR","nodeId":102,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Graduate Reading and Research"},{"courseId":"15744","treeType":"OR","nodeId":103,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course assumes a basic familiarity with networking concepts. The course will consist of a reading/lecture/discussion component and a project component. The class will cover approximately 50 research papers on various aspects of computer networking. These papers will introduce students to the basic design principles on which today\u0027s networks are based. In addition, these papers will cover recent proposals to improve network performance, functionality and scalability. Specific topics that will be covered include: LAN/WAN technologies, congestion/flow control, traffic analysis, routing, internet working, multicast, security, and quality of service. Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates.","title":"Computer Networks"},{"courseId":"15745","treeType":"OR","nodeId":104,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Description: Theoretical and practical aspects of building optimizing compilers that effectively exploit modern architectures. The course will begin with the fundamentals of compiler optimization, and will build upon these fundamentals to address issues in state-of-the-art commercial and research machines. Topics include: intermediate representations, basic blocks and flow graphs, data flow analysis, partial evaluation and redundancy elimination, loop optimizations, register allocation, instruction scheduling, interprocedural analysis, memory hierarchy optimizations, extracting parallelism, and dynamic optimizations. Students will implement significant optimizations within the framework of a modern research compiler. Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates.","title":"Optimizing Compilers for Modern Architectures"},{"courseId":"15746","treeType":"OR","nodeId":105,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"\u003cb\u003eDescription:\u003c/b\u003e Storage systems are among the most fascinating and the most important parts of computer systems. They often dominate the performance of a system, and their components\u0027 inner workings require amazing feats of engineering. At the same time, storage systems hold the crown jewels of most organizations: their information (from source code to Microsoft\u0027s software to the sales databases of every e-commerce site). Within the field of computer systems and computer engineering, there is no area whose demand for bright people and better solutions is more robust.","title":"Advanced Storage Systems"},{"courseId":"15749","treeType":"OR","nodeId":106,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Computing has changed beyond recognition in half a century, from the room-filling mainframes of the 1960s to today\u0027s smartphones and wearable devices. Networks have also changed dramatically: from the 300-baud dialup modems of the early networking era to gigabit LANs, Wi-Fi and 4G today. Who knows what changes are in store for us over the next half century? Astonishingly, in spite of this tremendous change in hardware technology over time, a small core set of techniques for building distributed systems has emerged and remained surprisingly stable and applicable across many system layers. Many flavors of these techniques exist, and they continously evolve over time to reflect changing trade-offs in the design space. What are these core techniques, and how can we leverage them in creating distributed systems today and in the future? That is the central question addressed by this course. Students will acquire the knowledge base, intellectual tools, hands-on skills and modes of thought needed to build well-engineered distributed systems that withstand the test of time, growth in scale, and stresses of live use. Strong design and implementation skills are expected of all students. The course assumes a high level of proficiency in all aspects of operating system design and implementation. A substantial project component is an integral part of the course. Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates.","title":"Engineering Distributed Systems"},{"courseId":"15750","treeType":"OR","nodeId":107,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.htm for the most recent schedule updates.","title":"Graduate Algorithms"},{"courseId":"15754","treeType":"OR","nodeId":108,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Please refer to \u003ca href\u003d\"http://www.cs.cmu.edu/~csd-grad/courseschedules11.html\"\u003ethis link\u003c/a\u003e for the most recent schedule updates.","title":"Machine-based Complexity Theory"},{"courseId":"15780","treeType":"OR","nodeId":109,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Description: This course is targeted at graduate students who want to learn about and perform current-day research in artificial intelligence---the discipline of designing intelligent decision-making machines. Techniques from probability, statistics, game theory, algorithms, operations research and optimal control are increasingly important tools for improving the intelligence and autonomy of machines, whether those machines are robots surveying Antarctica, schedulers moving billions of dollars of inventory, spacecraft deciding which experiments to perform, or vehicles negotiating for lanes on the freeway. This course covers the core of AI from a modern perspective. The course will cover the core ideas, their implementation, and how to use them or extend them in your research. The course includes a final project of each student\u0027s choosing. Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates.","title":"Graduate Artificial Intelligence"},{"courseId":"15781","treeType":"OR","nodeId":110,"isStarter":true,"prereqIndices":[],"postreqIndices":[114],"prereqLinks":[],"postreqLinks":[96],"description":"Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates.","title":"Machine Learning"},{"courseId":"15799","treeType":"OR","nodeId":111,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates. This course will consist of a paper-led survey of recent publications in modern operating and distributed systems and a time-consuming set of deep-dive coding projects starting with the first four projects of the concurrently offered 15-605, Operating Systems Design and Implementation, course and ending with a fifth project extending the fourth project to incorporate a state-of-the-art hardware/software challenge. The lecture material from 15-410/605 is assumed to have been learned in a prior course and enrollment in 15-605 is not required (although auditing some of the 15-605 lectures that address details of the early projects may be useful and 15-605 bulletin boards and TA hours may be similarly useful). This course is being offered as an elective (non-star course) for CSD (or ECE) PhD students, typically computer architecture or software systems students. Other students need instructor approval.","title":"Special Topics in Software Systems"},{"courseId":"15801","treeType":"OR","nodeId":112,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"CS PhD Alternative Elective"},{"courseId":"15802","treeType":"OR","nodeId":113,"isStarter":true,"prereqIndices":[114,116],"postreqIndices":[],"prereqLinks":[98,101],"postreqLinks":[],"description":"Please refer to \u003ca href\u003d\"http://www.cs.cmu.edu/~burks/courses/sp05/courseschedule.html\"\u003ethis link\u003c/a\u003e for the most recent schedule updates.","title":"CSD PhD Elective"},{"courseId":"","treeType":"OR","nodeId":114,"isStarter":true,"prereqIndices":[110,115],"postreqIndices":[113],"prereqLinks":[96,97],"postreqLinks":[98]},{"courseId":"10601","treeType":"OR","nodeId":115,"isStarter":true,"prereqIndices":[],"postreqIndices":[114],"prereqLinks":[],"postreqLinks":[97],"description":"","title":""},{"courseId":"","treeType":"OR","nodeId":116,"isStarter":true,"prereqIndices":[117,118],"postreqIndices":[113],"prereqLinks":[99,100],"postreqLinks":[101]},{"courseId":"36705","treeType":"OR","nodeId":117,"isStarter":true,"prereqIndices":[],"postreqIndices":[116],"prereqLinks":[],"postreqLinks":[99],"description":"","title":""},{"courseId":"36725","treeType":"OR","nodeId":118,"isStarter":true,"prereqIndices":[],"postreqIndices":[116],"prereqLinks":[],"postreqLinks":[100],"description":"","title":""},{"courseId":"15812","treeType":"OR","nodeId":119,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates. Description: We survey the theory behind the design, description, and implementation of programming languages, and of methods for specifying and verifying program behavior. Both imperative and functional programming languages are covered, as well as ways of integrating these paradigms into more general languages. Coverage will include: - program specification and proof (including Hoare logic, weakest preconditions, and separation logic) - concurrent programming (including shared-variable and message-passing approaches) - functional programing (including continuations and lazy evaluation) - type systems (including subtyping, polymorphism, and modularization) In exploring these topics, we will use a variety of fundamental concepts and techniques, such as compositional semantics, binding structure, domains, transition systems, and inference rules.","title":"Programming Language Semantics"},{"courseId":"15813","treeType":"OR","nodeId":120,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Section H: Description: The course covers the implementation of compilers for higher-order typed languages such as ML. Topics include type checking, type directed compilation, elaboration, phase splitting, CPS conversion, closure conversion, allocation, and garbage collection. Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates.","title":"HOT Compilation"},{"courseId":"15819","treeType":"OR","nodeId":121,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Please refer to http://www.cs.cmu.edu/~csd-grad/courseschedulef14.html this link for the most recent schedule updates.","title":"Advanced Topics in Programming Languages:"},{"courseId":"15845","treeType":"OR","nodeId":122,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"http://www.cs.cmu.edu/~csd-grad/courseschedulef14.html this link for the most recent schedule updates. Description: The seminar on \u0026quot;Current Research Topics in Computer Systems\u0026quot; is a weekly seminar in which PhD students present their research results. Each students typically makes two presentations each semester. The purpose of the seminar is to give students a forum in which they can improve their speaking skills in front of a friendly audience and in which they can get feedback on both preliminary research ideas and more mature research results. The seminar covers a wide range of topics in computer systems. In recent years, the focus has been on networking, mobile computing, network-awareness, and compilers.","title":"Current Research Issues in Computer Systems"},{"courseId":"15853","treeType":"OR","nodeId":123,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Please refer to https://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates.","title":"Algorithms in the Real World"},{"courseId":"15859","treeType":"OR","nodeId":124,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Please refer to https://www.cs.cmu.edu/~csd-grad/courseschedulef14.html this link for the most recent schedule updates. Section B: Machine Learning Theory Course Description: http://www.cs.cmu.edu/~avrim/ML14/coursedesc.html This course will focus on theoretical aspects of machine learning. We will examine questions such as: What kinds of guarantees can we prove about machine learning algorithms? Can we design algorithms for interesting learning tasks with strong guarantees on accuracy and amounts of data needed? (Why) is Occam\u0027s razor a good idea and what does that even mean? What can we say about the inherent ease or difficulty of learning problems? Can we devise models that are both amenable to theoretical analysis and make sense empirically? Addressing these questions will bring in connections to probability and statistics, online algorithms, game theory, complexity theory, information theory, cryptography, and empirical machine learning research.","title":"Special Topics in Theory: Machine Learning Theory"},{"courseId":"15869","treeType":"OR","nodeId":125,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course will explore research topics in physically based character animation, where the goal is to obtain a character performance that appears both natural and physically plausible. In particular, we will investigate how the physical properties of a character such as range of motion, weight distribution, and level of coordination constrain and suggest plausible motions for that character. We will explore theory and advances in motion controllers, strengths and limitations of motion optimization algorithms, opportunities for fast physics algorithms for interactive applications, the nature of natural motion and aspects of motion style. In addition to computer graphics literature, we will search biomechanics, human motor control, and evolutionary biology literature for insights obtained from these fields. The course should be appropriate for graduate students with some computer graphics and / or robotics experience and for advanced undergraduates who have taken 15-462 or equivalent. Please refer to https://www.cs.cmu.edu/~csd-grad/courseschedules14.html this link for the most recent schedule updates.","title":"Special Topics in Graphics: Physically Based Character Animation"},{"courseId":"15891","treeType":"OR","nodeId":126,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"href\u003d\u0026quot;http://www.cs.cmu.edu/~vunit/intro.html DESCRIPTION: Please refer to href\u003d\u0026quot;http://www.cs.cmu.edu/~csd-grad/courseschedulef13.html this link for the most recent schedule updates.","title":"V-Unit in Computer Science"},{"courseId":"15990","treeType":"OR","nodeId":127,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Computer Science Colloquium"},{"courseId":"15997","treeType":"OR","nodeId":128,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Graduate Reading and Research"},{"courseId":"15998","treeType":"OR","nodeId":129,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Practicum in Computer Science"},{"courseId":"18051","treeType":"OR","nodeId":130,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Students are encouraged to various international collaborative programs offered through the department of Electrical and Computer Engineering.","title":"Study Abroad"},{"courseId":"18100","treeType":"OR","nodeId":131,"isStarter":true,"prereqIndices":[132],"postreqIndices":[135,138,139],"prereqLinks":[102],"postreqLinks":[107,110,112],"description":"The goals of this freshman engineering course are: * To introduce basic concepts in electrical and computer engineering in an integrated manner; * To motivate basic concepts in the context of real applications; * To illustrate a logical way of thinking about problems and their solutions, and; * To convey the excitement of the profession. These goals are attained through analysis, construction and testing of an electromechanical system (e.g., a robot) that incorporates concepts from a broad range of areas within Electrical and Computer Engineering. Some of the specific topics that will be covered include system decomposition, ideal and real sources, Kirchhoff\u0027s Current and Voltage Laws, Ohm\u0027s Law, piecewise linear modeling of nonlinear circuit elements, Ideal Op-Amp characteristics, combinational logic circuits, Karnaugh Maps, Flip-Flops, sequential logic circuits, and finite state machines. 3 hrs. lec., 1 hr. rec., 3 hr. lab.","title":"Introduction to Electrical and Computer Engineering"},{"courseId":"21120","treeType":"OR","nodeId":132,"isStarter":true,"prereqIndices":[],"postreqIndices":[131,151],"prereqLinks":[],"postreqLinks":[102,125],"description":"","title":""},{"courseId":"21118","treeType":"OR","nodeId":133,"isStarter":true,"prereqIndices":[],"postreqIndices":[73],"prereqLinks":[],"postreqLinks":[104],"description":"","title":""},{"courseId":"21123","treeType":"OR","nodeId":134,"isStarter":true,"prereqIndices":[],"postreqIndices":[73],"prereqLinks":[],"postreqLinks":[105],"description":"","title":""},{"courseId":"18220","treeType":"OR","nodeId":135,"isStarter":true,"prereqIndices":[131,73,136],"postreqIndices":[140,154,240],"prereqLinks":[107,108,109],"postreqLinks":[114,129,270],"description":"This course covers fundamental topics that are common to a wide variety of electrical engineering devices and systems. The topics include an introduction to semiconductor devices and technology, DC circuit analysis techniques, operational amplifiers, energy storage elements, sinusoidal steady-state response, frequency domain analysis, filters, and transient response of first- and second-order systems. The laboratories allow students to use modern electronic instrumentation and to build and operate circuits that address specific concepts covered in the lectures, including semiconductor devices and sensors, layout, operational amplifiers, filters, signal detection and processing, power converters and circuit transients. 3 hrs. lec., 1 hr. rec., 3 hrs. lab.","title":"Electronic Devices and Analog Circuits"},{"courseId":"33107","treeType":"OR","nodeId":136,"isStarter":true,"prereqIndices":[],"postreqIndices":[135],"prereqLinks":[],"postreqLinks":[109],"description":"","title":""},{"courseId":"18232","treeType":"OR","nodeId":137,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The Department of Electrical and Computer Engineering at Carnegie Mellon considers experiential learning opportunities important educational options for its undergraduate students. One such option is conducting undergraduate research with a faculty member. Students do not need to officially register for undergraduate research unless they want it listed on their official transcripts. An ECE student who is involved in a research project and is interested in registering this undergraduate research for course credit on the official transcript may request to be enrolled in this course. To do this, the student should first complete the on-line undergraduate research form available on the ECE undergraduate student page. Once the form has been submitted and approved by the faculty member the student is conducting the research with, the ECE Undergraduate Office will add the course to the student\u0027s schedule. Typical credit is granted as one hour of research per week is equal to one unit of credit.","title":"Sophomore Projects"},{"courseId":"18240","treeType":"OR","nodeId":138,"isStarter":true,"prereqIndices":[131,8],"postreqIndices":[142,147,157,159,233,235],"prereqLinks":[110,111],"postreqLinks":[115,121,132,134,260,264],"description":"This course introduces basic issues in design and verification of modern digital systems. Topics include: Boolean algebra, digital number systems and computer arithmetic, combinational logic design and simplification, sequential logic design and optimization, register-transfer design of digital systems, basic processor organization and instruction set issues, assembly language programming and debugging, and a hardware description language. Emphasis is on the fundamentals: the levels of abstraction and hardware description language methods that allow designers to cope with hugely complex systems, and connections to practical hardware implementation problems. Students will use computer-aided digital design software and actual hardware implementation laboratories to learn about real digital systems. 3 hr. lec., 1 hr. rec., 3 hr. lab.","title":"Structure and Design of Digital Systems"},{"courseId":"18290","treeType":"OR","nodeId":139,"isStarter":true,"prereqIndices":[131,73],"postreqIndices":[155,172,238,239],"prereqLinks":[112,113],"postreqLinks":[130,152,268,269],"description":"This course develops the mathematical foundation and computational tools for processing continuous-time and discrete-time signals in both time and frequency domain. Key concepts and tools introduced and discussed in this class include linear time-invariant systems, impulse response, frequency response, convolution, filtering, sampling, and Fourier transform. Efficient algorithms like the fast Fourier transform (FFT) will be covered. The course provides background to a wide range of applications including speech, image, and multimedia processing, bio and medical imaging, sensor networks, communication systems, and control systems. This course serves as entry and prerequisite for any higher level course in the fields of signal processing, communications, and control. Prerequisite(s): 18-100 Corequisite(s): 18-202","title":"Signals and Systems"},{"courseId":"18310","treeType":"OR","nodeId":140,"isStarter":true,"prereqIndices":[135],"postreqIndices":[176,177,180,201,202],"prereqLinks":[114],"postreqLinks":[159,162,171,219,220],"description":"This course replaced 18311 in Spring 2005. In this course you will receive an introduction to the operation and fabrication of the most important semiconductor devices used in integrated circuit technology together with device design and layout. At the end of the course you will have a basic understanding of pn diodes, bipolar transistors, and MOSFETs as well as some light emitting and light detecting devices such as photodiodes, LEDs and solar cells. You will also receive an introduction to the fundamental concepts of semiconductor physics such as doping, electron and hole transport, and band diagrams. In the laboratory you will learn how to lay out both bipolar and MOS devices and you will design small (2-3 transistor) circuits. The laboratory portion of the course emphasizes the relation between device design and layout and circuit performance. You will also experimentally evaluate the operation of amplifier and gate circuits fabricated with discrete devices. This course will give you an excellent understanding of the operation and fabrication of the devices which is necessary for high-performance analog and digital circuit design. 3 hrs. lec. (Note: the prerequisite is typically waived for MSE students who intend to pursue the Electronic Materials Minor.)","title":"Fundamentals of Semiconductor Devices"},{"courseId":"18332","treeType":"OR","nodeId":141,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The Department of Electrical and Computer Engineering at Carnegie Mellon considers experiential learning opportunities important educational options for its undergraduate students. One such option is conducting undergraduate research with a faculty member. Students do not need to officially register for undergraduate research unless they want it listed on their official transcripts. An ECE student who is involved in a research project and is interested in registering this undergraduate research for course credit on the official transcript may request to be enrolled in this course. To do this, the student should first complete the on-line undergraduate research form available on the ECE undergraduate student page. Once the form has been submitted and approved by the faculty member the student is conducting the research with, the ECE Undergraduate Office will add the course to the student\u0027s schedule. Typical credit is granted as one hour of research per week is equal to one unit of credit.","title":"Junior Projects"},{"courseId":"18340","treeType":"OR","nodeId":142,"isStarter":true,"prereqIndices":[138],"postreqIndices":[162,183,224,236],"prereqLinks":[115],"postreqLinks":[139,178,244,266],"description":"In this course we will explore the techniques for designing high-performance digital circuits for computation along with methods for evaluating their properties. We begin by quickly reviewing number systems and digital arithmetic along with basic arithmetic circuits such as ripple-carry adders. We then focus on formal techniques and theory for analyzing the functionality, timing, power consumption, and chip area properties of these basic circuits and ones yet to be presented. From there, we move to more complex adders (carry-lookahead, carry-skip, carry_bypass, Wallace trees, and hybrid techniques) and multipliers (sequential, array, Booth, and others) along with various divider circuits. Floating point units are then built upon the concepts introduced for adder, multipliers, and dividers. Finally, we will investigate the design and implementation of digital filter circuits. For each circuit introduced, we will develop techniques for evaluating their functionality, their speed, power consumption, and silicon area requirements. In addition, we will utilize various CAD tools to design and evaluate most of the computation circuits discussed. After successful completion of the course, students will not only have an understanding of complex computation circuits, but subtle concepts that include hazards, metastability, false paths, inertial delay, sticky bits, clock skew/jitter, dynamic and static sensitization, and many others. 3 hrs. lec., 1 hr. rec.","title":"Digital Computation"},{"courseId":"18345","treeType":"OR","nodeId":143,"isStarter":true,"prereqIndices":[144,72],"postreqIndices":[232,246],"prereqLinks":[119,120],"postreqLinks":[256,278],"description":"This course introduces the fundamental concepts of telecommunication networks. Underlying engineering principles of telephone networks, computer networks and integrated digital networks are discussed. Topics in the course include: telephone and data networks overview; OSI layers; data link protocol; flow control, congestion control, routing; local area networks; transport layer; introduction to high-speed networks; performance evaluation techniques. The course also reviews important aspects of network security and widely used classes of Internet application and services, such as peer-to-peer, content delivery networks, and video streaming.","title":"Introduction to Telecommunication Networks"},{"courseId":"","treeType":"OR","nodeId":144,"isStarter":true,"prereqIndices":[57,145,146],"postreqIndices":[143],"prereqLinks":[116,117,118],"postreqLinks":[119]},{"courseId":"36212","treeType":"OR","nodeId":145,"isStarter":true,"prereqIndices":[],"postreqIndices":[144],"prereqLinks":[],"postreqLinks":[117],"description":"","title":""},{"courseId":"36226","treeType":"OR","nodeId":146,"isStarter":true,"prereqIndices":[],"postreqIndices":[144],"prereqLinks":[],"postreqLinks":[118],"description":"","title":""},{"courseId":"18348","treeType":"OR","nodeId":147,"isStarter":true,"prereqIndices":[138,72],"postreqIndices":[162,183,186,188,191,192,194,218,219,227,242],"prereqLinks":[121,122],"postreqLinks":[141,180,189,195,198,201,205,228,231,250,275],"description":"Embedded computing applications far outnumber desktop computers, with billions of microcontrollers produced worldwide each year. Embedded systems vary tremendously, from the single 8-bit processor in a thermostat, to high performance processors in a digital camera, to dozens of networked processors in an automobile. Despite this diversity of applications, there are core technology and system-level skills needed by any embedded system designer that form the content of this course. The emphasis of this course will be at the system layer where hardware meets software, with plenty of hands-on experience at \u0026quot;bare metal\u0026quot; programming. Topics typically covered include embedded computing platforms (hardware, microcontroller instruction sets, software in both assembly language and C); interacting with the external world (analog I/O, digital I/O, serial ports, filtering, control, embedded networks); system-level engineering (design cycle, architectural patterns, peer reviews); real-time operation (timers, interrupts, concurrency, task switching, writing a simple RTOS kernel, scheduling); constraints and optimization (economics, power, performance); and a survey of techniques important for building systems that work in the real world (debug, test, robust design, dependability, safety, ethical/societal issues). Weekly hands-on hardware and software experiences with a 16-bit microcontroller module will tie directly to lectures to reinforce core skills. 4 hrs. lec., 1 hr. rec., 3 hrs. lab. Anti-requisites: 18342 or 18349","title":"Embedded Systems Engineering"},{"courseId":"18390","treeType":"OR","nodeId":148,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The Department of Electrical and Computer Engineering at Carnegie Mellon considers experiential learning opportunities important educational options for its undergraduate students. One such option is cooperative education, which provides a student with an extended period of exposure with a company. To participate, students must complete an ECE Co-op Approval form (located in HH 1115) and submit for approval. Students must possess at least junior status and have an overall grade point average of 3.0 or above. All co-ops must be approximately 8 months in uninterrupted length. If the co-op is approved, the ECE Undergraduate Studies Office will add the course to the student\u0027s schedule. Upon completion of the co-op experience, students must submit a 1-2 page report of their work experience, and a 1-2 page evaluation from the company supervisor to the ECE Undergraduate Office. International students should also be authorized by the Office of International Education (OIE). More information regarding CPT is available on OIE\u0027s website.","title":"ECE CO-OP"},{"courseId":"18402","treeType":"OR","nodeId":149,"isStarter":true,"prereqIndices":[150],"postreqIndices":[],"prereqLinks":[123],"postreqLinks":[],"description":"This course builds upon the electric and magnetic field foundations established in 18-300 to describe phenomena and devices where electromagnetic waves are a central issue. Topics include: review of Maxwell?s equations, propagation of uniform plane waves in lossless and lossy media, energy conservation as described by the Poynting Theorem, reflection and transmission with normal and oblique incidence upon boundaries, sinusoidal steady state and transients on 2-conductor transmission lines, modal descriptions of waveguides, radiation and antennas. 4 hrs. lec.","title":"Applied Electrodynamics"},{"courseId":"18300","treeType":"OR","nodeId":150,"isStarter":true,"prereqIndices":[],"postreqIndices":[149,174,175,179],"prereqLinks":[],"postreqLinks":[123,153,156,168],"description":"","title":""},{"courseId":"18411","treeType":"OR","nodeId":151,"isStarter":true,"prereqIndices":[152,132,43,70,153],"postreqIndices":[],"prereqLinks":[124,125,126,127,128],"postreqLinks":[],"description":"This course develops the methods to formulate basic engineering problems in a way that makes them amenable to computational/numerical analysis. The course will consist of three main modules: basic programming skills, discretization of ordinary and partial differential equations, and numerical methods. These modules are followed by two modules taken from a larger list: Monte Carlo-based methods, molecular dynamics methods, image analysis methods, and so on. Students will learn how to work with numerical libraries and how to compile and execute scientific code written in Fortran-90 and C++. Students will be required to work on a course project in which aspects from at least two course modules must be integrated.","title":"Computational Techniques in Engineering"},{"courseId":"15100","treeType":"OR","nodeId":152,"isStarter":true,"prereqIndices":[],"postreqIndices":[151],"prereqLinks":[],"postreqLinks":[124],"description":"","title":""},{"courseId":"21260","treeType":"OR","nodeId":153,"isStarter":true,"prereqIndices":[],"postreqIndices":[151],"prereqLinks":[],"postreqLinks":[128],"description":"","title":""},{"courseId":"18418","treeType":"OR","nodeId":154,"isStarter":true,"prereqIndices":[135],"postreqIndices":[],"prereqLinks":[129],"postreqLinks":[],"description":"This course provides an introduction to the fundamentals of electrical energy conversion and its use in several real-life systems. The course starts with a brief review of general mathematical and physical principles necessary for subsequent study of electrical energy conversion applications. This includes modeling, analysis, and control of general physical systems in time and frequency domain. Since the focus of energy conversion methods studied in this course is from electrical to mechanical systems, special attention is paid to electromagnetic theory. Rotating machines theory is developed and intuitively explained starting with Maxwell equations and analyzing general static and dynamic electromagnetic circuits. Power electronics methods are also introduced because most of modern electrical systems employ such methods. At this point, the necessary background is gained to analyze real life electrical energy conversion systems. We will focus on automotive, airplane, space station, and sea power systems. The main focus will be on operational principles and when appropriate stability issues of particular implementations. Time allowing, dynamic problems with interconnecting such systems will be briefly introduced and possibly studied by curious students in their course projects.","title":"Electric Energy Processing: Fundamentals and Applications"},{"courseId":"18421","treeType":"OR","nodeId":155,"isStarter":true,"prereqIndices":[139,156],"postreqIndices":[179,180],"prereqLinks":[130,131],"postreqLinks":[169,172],"description":"The purpose of this course is to introduce the student to the fundamentals of the analysis and design of basic analog circuits. Topics to be covered include transistor large- and small-signal device models, DC bias calculations, small-signal gain and frequency response characteristics of transistor-based amplifiers, large-signal amplifier characteristics and nonidealities, operational amplifier design, basic amplifier feedback theory, frequency stability and compensation. In the hardware laboratory the student will gain experience designing, building, and characterizing analog circuits. The students will also learn how to use the SPICE circuit simulation program to compare actual and simulated performance. The analysis and design of analog circuits incorporating both Bipolar and CMOS technologies will be considered.","title":"Analog Integrated Circuits I"},{"courseId":"18320","treeType":"OR","nodeId":156,"isStarter":true,"prereqIndices":[],"postreqIndices":[155,157,162,174,176,178,182,185,191,197,198,218,221,223,224,225,233,234],"prereqLinks":[],"postreqLinks":[131,133,143,154,160,166,174,183,199,214,217,229,235,240,243,246,261,262],"description":"","title":""},{"courseId":"18422","treeType":"OR","nodeId":157,"isStarter":true,"prereqIndices":[138,156],"postreqIndices":[],"prereqLinks":[132,133],"postreqLinks":[],"description":"This course covers the design and implementation of digital circuits in a modern VLSI process technology. Topics will include logic gate design, functional unit design, latch/flip-flop design, system clocking, memory design, clock distribution, power supply distribution, design for test, and design for manufacturing. The lab component of the course will focus on using modern computer aided design (CAD) software to design, simulate, and lay out digital circuits. The final project for the course involves the design and implementation to the layout level of a moderately sized computational block.","title":"Digital Integrated Circuits 1"},{"courseId":"18432","treeType":"OR","nodeId":158,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The Department of Electrical and Computer Engineering at Carnegie Mellon considers experiential learning opportunities important educational options for its undergraduate students. One such option is conducting undergraduate research with a faculty member. Students do not need to officially register for undergraduate research unless they want it listed on their official transcripts. An ECE student who is involved in a research project and is interested in registering this undergraduate research for course credit on the official transcript may request to be enrolled in this course. To do this, the student should first complete the on-line undergraduate research form available on the ECE undergraduate student page. Once the form has been submitted and approved by the faculty member the student is conducting the research with, the ECE Undergraduate Office will add the course to the student\u0027s schedule. Typical credit is granted as one hour of research per week is equal to one unit of credit.","title":"Senior Projects"},{"courseId":"18447","treeType":"OR","nodeId":159,"isStarter":true,"prereqIndices":[138,160,162],"postreqIndices":[185,205],"prereqLinks":[134,138,144],"postreqLinks":[186,221],"description":"Computer architecture is the science and art of selecting and interconnecting hardware components to create a computer that meets functional, performance and cost goals. This course introduces the basic hardware structure of a modern programmable computer including, the basic laws underlying performance evaluation. We will learn, for example, how to design the control and data path hardware for a MIPS-like processor, how to make machine instructions execute simultaneously through pipelining and simple superscalar execution, and how to design fast memory and storage systems. The principles presented in lecture are reinforced in the laboratory through design and simulation of a register transfer (RT) implementation of a MIPS-like pipelined superscalar in Verilog. Learning to design programmable systems requires that you already have the knowledge of building RT systems as is taught in the prerequisite 18-240, the knowledge of the behavior storage hierarchies (e.g., cache memories) and virtual memory as is taught in the prerequisite 15-213, and the knowledge of assembly language programming as is taught in the prerequisites. 3 hrs. lec., 3 hrs. lab.","title":"Introduction to Computer Architecture"},{"courseId":"","treeType":"OR","nodeId":160,"isStarter":true,"prereqIndices":[13,72,161],"postreqIndices":[159],"prereqLinks":[135,136,137],"postreqLinks":[138]},{"courseId":"18243","treeType":"OR","nodeId":161,"isStarter":true,"prereqIndices":[],"postreqIndices":[160,166],"prereqLinks":[],"postreqLinks":[137,146],"description":"","title":""},{"courseId":"","treeType":"OR","nodeId":162,"isStarter":true,"prereqIndices":[142,163,147,164,156],"postreqIndices":[159],"prereqLinks":[139,140,141,142,143],"postreqLinks":[144]},{"courseId":"18341","treeType":"OR","nodeId":163,"isStarter":true,"prereqIndices":[],"postreqIndices":[162,183,225,236],"prereqLinks":[],"postreqLinks":[140,179,247,265],"description":"","title":""},{"courseId":"18349","treeType":"OR","nodeId":164,"isStarter":true,"prereqIndices":[],"postreqIndices":[162,183,186,188,195,196,197,221,222,227,242],"prereqLinks":[],"postreqLinks":[142,181,190,196,207,210,213,234,237,251,276],"description":"","title":""},{"courseId":"18474","treeType":"OR","nodeId":165,"isStarter":true,"prereqIndices":[166,167],"postreqIndices":[],"prereqLinks":[147,150],"postreqLinks":[],"description":"This course introduces principles for design of embedded controllers. In applications ranging from airplanes, to automobiles, to manufacturing systems, embedded computers now close feedback loops that were previously closed by mechanical devices or by humans in the loop. This course emphasizes practical insight into the tools for modeling and simulating these dynamic physical systems, and methods for designing the real-time software for embedded computers to control them. Lectures cover relevant theory and background from real-time systems and control engineering, including event-based and clock-based sampling, switching control, PWM (pulse-width modulation), PID (proportional-integral-derivative) design, state-variable feedback, state estimation, and methods for setpoint control and trajectory tracking. Basic embedded computing, sensor, and actuator technologies are reviewed, including microcontrollers, DC motors and optical encoders. In the laboratory, students use commercial tools for simulation and automatic code generation to design and implement embedded control system experiments. 3 hrs. lecture, 3 hrs. lab.","title":"Embedded Control Systems"},{"courseId":"","treeType":"OR","nodeId":166,"isStarter":true,"prereqIndices":[13,161],"postreqIndices":[165],"prereqLinks":[145,146],"postreqLinks":[147]},{"courseId":"","treeType":"OR","nodeId":167,"isStarter":true,"prereqIndices":[168,169],"postreqIndices":[165],"prereqLinks":[148,149],"postreqLinks":[150]},{"courseId":"18396","treeType":"OR","nodeId":168,"isStarter":true,"prereqIndices":[],"postreqIndices":[167],"prereqLinks":[],"postreqLinks":[148],"description":"","title":""},{"courseId":"18370","treeType":"OR","nodeId":169,"isStarter":true,"prereqIndices":[],"postreqIndices":[167,182,185,188,194,195,198,253],"prereqLinks":[],"postreqLinks":[149,175,184,193,204,208,216,285],"description":"","title":""},{"courseId":"18482","treeType":"OR","nodeId":170,"isStarter":true,"prereqIndices":[171],"postreqIndices":[],"prereqLinks":[151],"postreqLinks":[],"description":"This course provides a comprehensive introduction to basic principles of telecommunications technology and the telephone network, and the legal, economic, and regulatory environment of the telecommunications industry. Role of new technologies such as fiber, integrated digital networks, computer communications, and information services. Common carrier law and the economics of natural monopoly as the basis for regulation of the telecommunications industry. Issues of competition, monopoly and technical standards. Spectrum allocation and management. International communications and transborder data flow. Special emphasis on how the new technologies have altered and are altered by regulation. Junior or Senior standing required.","title":"Telecommunications, Technology Policy \u0026amp; Management"},{"courseId":"73100","treeType":"OR","nodeId":171,"isStarter":true,"prereqIndices":[],"postreqIndices":[170],"prereqLinks":[],"postreqLinks":[151],"description":"","title":""},{"courseId":"18491","treeType":"OR","nodeId":172,"isStarter":true,"prereqIndices":[139],"postreqIndices":[175,177,178,182,185,187],"prereqLinks":[152],"postreqLinks":[157,163,165,176,185,192],"description":"This course addresses the mathematics, implementation, design and application of the digital signal processing algorithms widely used in areas such as multimedia telecommunications and speech and image processing. Topics include discrete-time signals and systems, discrete-time Fourier transforms and Z-transforms, discrete Fourier transforms and fast Fourier transforms, digital filter design and implementation, and multi-rate signal processing. The course will include introductory discussions of 2-dimensional signal processing, linear prediction, adaptive filtering, and selected application areas. Classroom lectures are supplemented with implementation exercises using MATLAB.","title":"Fundamentals of Signal Processing"},{"courseId":"18510","treeType":"OR","nodeId":173,"isStarter":true,"prereqIndices":[174,175,176,177,178,179,180],"postreqIndices":[],"prereqLinks":[155,158,161,164,167,170,173],"postreqLinks":[],"description":"Please refer to the ECE webpage for a full description of this course. http://www.ece.cmu.edu/courses/18510","title":"Sensor Systems Design"},{"courseId":"","treeType":"AND","nodeId":174,"isStarter":true,"prereqIndices":[150,156],"postreqIndices":[173],"prereqLinks":[153,154],"postreqLinks":[155]},{"courseId":"","treeType":"AND","nodeId":175,"isStarter":true,"prereqIndices":[150,172],"postreqIndices":[173],"prereqLinks":[156,157],"postreqLinks":[158]},{"courseId":"","treeType":"AND","nodeId":176,"isStarter":true,"prereqIndices":[140,156],"postreqIndices":[173],"prereqLinks":[159,160],"postreqLinks":[161]},{"courseId":"","treeType":"AND","nodeId":177,"isStarter":true,"prereqIndices":[140,172],"postreqIndices":[173],"prereqLinks":[162,163],"postreqLinks":[164]},{"courseId":"","treeType":"AND","nodeId":178,"isStarter":true,"prereqIndices":[172,156],"postreqIndices":[173],"prereqLinks":[165,166],"postreqLinks":[167]},{"courseId":"","treeType":"AND","nodeId":179,"isStarter":true,"prereqIndices":[150,155],"postreqIndices":[173],"prereqLinks":[168,169],"postreqLinks":[170]},{"courseId":"","treeType":"AND","nodeId":180,"isStarter":true,"prereqIndices":[140,155],"postreqIndices":[173],"prereqLinks":[171,172],"postreqLinks":[173]},{"courseId":"18540","treeType":"OR","nodeId":181,"isStarter":true,"prereqIndices":[182,183],"postreqIndices":[],"prereqLinks":[177,182],"postreqLinks":[],"description":"This is a project-oriented course which will deal with all four aspects of project development; the application, the artifact, the computer-aided design environment, and the physical prototyping facilities. The class, in conjunction with the instructors, will develop specifications for a mobile computer to assist in inspection and maintenance. The application will be partitioned between human computer interaction, electronics, industrial design, mechanical, and software components. The class will be divided into groups to specify, design, and implement the various subsystems. The goal is to produce a working hardware/software prototype of the system and to evaluate the user acceptability of the system. We will also monitor our progress in the design process by capturing our design escapes (errors) with the Orthogonal Defect Classification (ODC). Upon completion of this course the student will be able to: generate systems specifications from a perceived need; partition functionality between hardware and software; produce interface specifications for a system composed of numerous subsystems; use computer-aided design tools; fabricate, integrate, and debug a hardware/software system; and evaluate the system in the context of an end user application. Senior standing is required.","title":"Rapid Prototyping of Computer Systems"},{"courseId":"","treeType":"OR","nodeId":182,"isStarter":true,"prereqIndices":[156,169,172],"postreqIndices":[181],"prereqLinks":[174,175,176],"postreqLinks":[177]},{"courseId":"","treeType":"OR","nodeId":183,"isStarter":true,"prereqIndices":[142,163,147,164],"postreqIndices":[181],"prereqLinks":[178,179,180,181],"postreqLinks":[182]},{"courseId":"18549","treeType":"OR","nodeId":184,"isStarter":true,"prereqIndices":[185,186],"postreqIndices":[],"prereqLinks":[188,191],"postreqLinks":[],"description":"18-549 Embedded Systems Design This course comprises a semester-long project experience geared towards the development of skills to design realistic and practical embedded systems and applications. Students will work in teams on an innovative project that will involve the hands-on design, configuration, engineering, implementation and testing of a prototype of an embedded system of their choice. Students will be expected to leverage proficiency and background gained from other courses, particularly with regard to embedded real-time principles and embedded programming. The project will utilize a synergistic mixture of skills in system architecture, modular system design, software engineering, subsystem integration, debugging and testing. From inception to demonstration of the prototype, the course will follow industrial project practices, such as version control, design requirements, design reviews and quality assurance plans. The initial lecture content will cover background material intended to complement the project work. The remainder of the course will consist of regular team presentations of key project milestones, current project status, a final project presentation and functional demonstrations of various subsystems, even as the entire prototype is being developed. Please refer to the course website for more information: http://www.ece.cmu.edu/~ece549/","title":"Embedded Systems Design"},{"courseId":"","treeType":"OR","nodeId":185,"isStarter":true,"prereqIndices":[156,169,172,159,44],"postreqIndices":[184],"prereqLinks":[183,184,185,186,187],"postreqLinks":[188]},{"courseId":"","treeType":"OR","nodeId":186,"isStarter":true,"prereqIndices":[147,164],"postreqIndices":[184],"prereqLinks":[189,190],"postreqLinks":[191]},{"courseId":"18551","treeType":"OR","nodeId":187,"isStarter":true,"prereqIndices":[172,188],"postreqIndices":[],"prereqLinks":[192,197],"postreqLinks":[],"description":"This course provides the student with a rich, in-depth design and application hardware project experience in the areas of digital communications and/or signal processing systems using DSP hardware. Teams of students work on a semester-long project of their choice. Topics include: speech and music processing, digital communications, multimedia processing, data compression, data storage, wireless communications, CD, image and/or signal processing, etc. One month of introductory laboratories familiarize the students with DSP hardware and support software. Lectures address z-transforms, IIR and FIR filter design using MATLAB and DSP hardware, LPC and adaptive filters, channel coding, time and frequency multiplexing, short time Fourier and wavelet transforms, and spread spectrum techniques. 4 hrs. lec., 3 hrs. lab.","title":"Digital Communication and Signal Processing Systems Design"},{"courseId":"","treeType":"OR","nodeId":188,"isStarter":true,"prereqIndices":[169,189,147,164],"postreqIndices":[187],"prereqLinks":[193,194,195,196],"postreqLinks":[197]},{"courseId":"18496","treeType":"OR","nodeId":189,"isStarter":true,"prereqIndices":[],"postreqIndices":[188],"prereqLinks":[],"postreqLinks":[194],"description":"","title":""},{"courseId":"18578","treeType":"OR","nodeId":190,"isStarter":true,"prereqIndices":[191,192,194,195,196,197,198],"postreqIndices":[],"prereqLinks":[200,203,206,209,212,215,218],"postreqLinks":[],"description":"Mechatronics is the synergistic integration of mechanism, electronics, and computer control to achieve a functional system. Because of the emphasis upon integration, this course will center around system integration in which small teams of students will configure, design, and implement a succession of mechatronic subsystems, leading to a main project. Lectures will complement the laboratory experience with comparative surveys, operational principles, and integrated design issues associated with the spectrum of mechanism, electronics, and control components. Class lectures will cover topics intended to complement the laboratory work, including mechanisms, actuators, motor drives, sensors and electronic interfaces, microcontroller hardware and programming and basic controls. During the first week of class, each student will be asked to complete a questionnaire about their technical background. The class will then be divided into multi-disciplinary teams of three students. During the first half of the class, lab assignments will be made every 1-2 weeks to construct useful subsystems based on material learned in lecture. The lab assignments are geared to build to the main project. This course is cross-listed as 16-778 and 24-778. Students in other departments may take the course upon availability of slots with permission of instructor. Non ECE students may take the course upon availability of slots with permission of the instructor.","title":"Mechatronic Design"},{"courseId":"","treeType":"AND","nodeId":191,"isStarter":true,"prereqIndices":[147,156],"postreqIndices":[190],"prereqLinks":[198,199],"postreqLinks":[200]},{"courseId":"","treeType":"AND","nodeId":192,"isStarter":true,"prereqIndices":[147,193],"postreqIndices":[190],"prereqLinks":[201,202],"postreqLinks":[203]},{"courseId":"15313","treeType":"OR","nodeId":193,"isStarter":true,"prereqIndices":[],"postreqIndices":[192,196],"prereqLinks":[],"postreqLinks":[202,211],"description":"","title":""},{"courseId":"","treeType":"AND","nodeId":194,"isStarter":true,"prereqIndices":[169,147],"postreqIndices":[190],"prereqLinks":[204,205],"postreqLinks":[206]},{"courseId":"","treeType":"AND","nodeId":195,"isStarter":true,"prereqIndices":[164,169],"postreqIndices":[190],"prereqLinks":[207,208],"postreqLinks":[209]},{"courseId":"","treeType":"AND","nodeId":196,"isStarter":true,"prereqIndices":[164,193],"postreqIndices":[190],"prereqLinks":[210,211],"postreqLinks":[212]},{"courseId":"","treeType":"AND","nodeId":197,"isStarter":true,"prereqIndices":[164,156],"postreqIndices":[190],"prereqLinks":[213,214],"postreqLinks":[215]},{"courseId":"","treeType":"AND","nodeId":198,"isStarter":true,"prereqIndices":[169,156],"postreqIndices":[190],"prereqLinks":[216,217],"postreqLinks":[218]},{"courseId":"18601","treeType":"OR","nodeId":199,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Ever want to start a company? Thinking about commercializing an innovation? Want to know what VCs really think? Do you have what it takes to be an entrepreneur? Then this is the class for you. Entrepreneurship and Innovation in Technology is an introductory course in entrepreneurship for graduate students. The course targets non-business students and assumes no background in business. Students are exposed to fundamental concepts and issues around innovation and entrepreneurship. The course provides a foundation for starting a new venture and innovating new technologies and products within existing organizations. Topics covered will include: identifying a business opportunity, acquiring customers, building a team, developing a business model, understanding investment, managing risk, and achieving differentiation. Emphasis will be on team projects, including developing an investor pitch for an original idea.","title":"Entrepreneurship and Innovation in Technology"},{"courseId":"18603","treeType":"OR","nodeId":200,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"It\u0027s not enough to understand the latest cad software, and be proficient at rigorous mathematical analysis. Being an inspired and innovative engineer is not really enough. To accomplish your goals as an engineer you have to understand how organizations work, and how to get all kinds of people to help you. In other words, you need to be a leader in your organization, whether that is a start-up or a Fortune 100 company. The class will begin by reviewing basic economics and financial accounting terms: a leader must know something about money. There will be hands-on classes on the predominant American corporate culture: a leader must know the atmosphere he or she breathes. The meat of the course will be learning about four keys to leadership: a working knowledge of variability in processes and people; some basic psychology, including personality types; some epistemology---how to really know what you think you know; and systems theory to understand all the parts of an enterprise. Classroom demonstrations and ungraded homework will illustrate each of these four keys. Each situation requiring leadership is unique, but studying the four keys will prepare you to step in and act with confidence. When you finish this course you will be prepared to lead not just an engineering team, but to lead an enterprise.","title":"Leadership for Engineers"},{"courseId":"18610","treeType":"OR","nodeId":201,"isStarter":true,"prereqIndices":[140],"postreqIndices":[],"prereqLinks":[219],"postreqLinks":[],"description":"This course is intended to provide a foundation in device operation for circuit designers working in today\u0027s sub-micron CMOS. This course will also provide advanced understanding of CMOS technology for those interested in integrated circuit process technology and device physics. We review semiconductor device physics, including carrier dynamics and the basic equations of semiconductor device physics. The operation of the p-n junction diode is also reviewed. The course includes a description of integrated circuit fabrication technology and how it is used to fabricate CMOS devices. With this foundation, we then discuss the MOS capacitor (including its application as a varactor). The theory of the MOS transistor will then be developed, followed by a discussion of important phenomena in sub-micron devices such as: velocity saturation; breakdown; drain-induced barrier lowering; random dopant fluctuations, etc. The student will learn the relationship between device geometry, e.g. length, and fabrication, e.g. doping, and the corresponding circuit performance. The course will primarily be lecture-based, with some selected simulation exercises. Students are expected to be acquainted with the basic concepts of electrical circuits; electromagnetic fields at the level of a sophomore level physics course, and to have adequate preparation in mathematics (basic differential equations and MATLAB or similar applications). Prior coursework in device physics is helpful but not required for graduate students. Lecture: 4 hrs Prerequisite(s): 18-310","title":"Fundamentals of Modern CMOS Devices"},{"courseId":"18615","treeType":"OR","nodeId":202,"isStarter":true,"prereqIndices":[140],"postreqIndices":[],"prereqLinks":[220],"postreqLinks":[],"description":"This course is intended to introduce students to the process flow and design methodology for integrated systems fabrication. The course will present this material through two paths. Lectures will be presented on the basic unit processes of micro and nanosystems fabrication: deposition, patterning, and etching. Lectures will draw on examples from: Semiconductor device fabrication; Microelectromechanical systems (MEMS) fabrication; Magnetic device fabrication, and; Optical device fabrication. Problem sets will be given based on this lecture material to allow students to quantitatively analyze certain process steps in detail. The second path for material presentation will be through a series of labs that allow students to design, fabricate and test an integrated device. These laboratories will be scheduled at regular meeting times, and will use research facilities within the ECE Department. 6 hrs. lec., 6 hrs. lab Prerequisites: 18-310, senior standing with instructor\u0027s permission, or graduate standing","title":"Micro and Nano Systems Fabrication"},{"courseId":"18625","treeType":"OR","nodeId":203,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"TBA","title":"System on Chip Design"},{"courseId":"18637","treeType":"OR","nodeId":204,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"With communication and network services and applications increasingly leveraging wireless media, the importance of information and network security in the wireless domain continues to grow. The challenges of providing secure communication and network services are considerably more difficult in wireless environments than in traditional wired systems (e.g., the Internet), so the focus of the course will be purely wireless environments such as wireless ad hoc, mesh, and sensor networks. Coverage will focus on wireless vulnerabilities and attacks at various layers of the protocol stack, spanning the stack from aspects of physical communication to application and service security issues. Focus will be placed on securing the operation and performance of wireless networks, with less emphasis on information security. Topics include MAC-layer misbehavior; selective packet dropping, modification, and insertion; jamming; distributed trust in ad hoc environments; reputation systems; and cross-layer attacks. Class material will be largely based on recent and current research; students will read and present recent research papers and participate in a group research project.","title":"Wireless Network Security"},{"courseId":"18640","treeType":"OR","nodeId":205,"isStarter":true,"prereqIndices":[159],"postreqIndices":[],"prereqLinks":[221],"postreqLinks":[],"description":"Computer Architecture deals with the art and science of designing modern computer systems, defines the HW/SW interface (Instruction Set Architecture), and codifies a large body of implementation techniques for achieving performance improvement and power efficiency. This graduate level course covers the three main subsystems of Processor, Memory, and I/O, and addresses Performance and Power optimizations. Processor design is the primary focus covering: pipelined and superscalar processor design; multi-core and multi-processor systems; special-purpose processors. Memory and I/O topics include: memory hierarchy and virtual memory; shared-memory model and cache coherence; I/O devices and storage systems. Performance and Power topics include: instruction-level, memory-level and thread-level parallelisms; instruction flow and data flow optimizations; performance vs. power tradeoffs; iron laws governing performance, power, and energy efficiency. Prerequisite: undergraduate course on Computer Architecture","title":"Foundations of Computer Architecture"},{"courseId":"18641","treeType":"OR","nodeId":206,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"This course provides an intensive exploration of computer programming in the Java Language, teaching the basics and then going on to teach smart phone development using Java. It is intended for master\u0027s students who have had some prior, but perhaps limited, programming experience in Java or another programming language; it is not intended as a first course in programming. Prerequisites: Graduate Standing; a previous course in programming, or equivalent experience and consent of the instructor. This course is broadcast from Silicon Valley to the Pittsburgh Campus.","title":"Java Smart Phone Development"},{"courseId":"18645","treeType":"OR","nodeId":207,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The fast evolution and increasing complexity of computing platforms pose a major challenge for developers of high performance software for engineering, science, and consumer applications: it becomes increasingly harder to harness the available computing power. Straightforward implementations may lose as much as one or two orders of magnitude in performance. On the other hand, creating optimal implementations requires the developer to have an understanding of algorithms, capabilities and limitations of compilers, and the target platform\u0027s architecture and microarchitecture. This interdisciplinary course introduces the student to the foundations and state-of-the-art techniques in high performance software development using important functionality such as linear algebra kernels, transforms, filters, and others as examples. The course will explain how to optimize for the memory hierarchy, take advantage of special instruction sets, and how to write parallel code for multicore, manycore, and cluster platforms, based on state-of-the-art research. Further, a general strategy for performance analysis and optimization is introduced that the students will apply in group projects that accompany the course. Finally, the course will introduce the students to the recent field of automatic performance tuning. Prerequiste: Senior ECE or CS undergraduate student or higher, solid C programming skills.","title":"How to Write Fast Code"},{"courseId":"18698","treeType":"OR","nodeId":208,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The brain is among the most complex systems ever studied. Underlying the brain\u0027s ability to process sensory information and drive motor actions is a network of roughly 1011 neurons, each making 103 connections with other neurons. Modern statistical and machine learning tools are needed to interpret the plethora of neural data being collected, both for (1) furthering our understanding of how the brain works, and (2) designing biomedical devices that interface with the brain. This course will cover a range of statistical methods and their application to neural data analysis. The statistical topics include latent variable models, dynamical systems, point processes, dimensionality reduction, Bayesian inference, and spectral analysis. The neuroscience applications include neural decoding, firing rate estimation, neural system characterization, sensorimotor control, spike sorting, and field potential analysis. Prerequisites: 18-290; 36-217, or equivalent introductory probability theory and random variables course; an introductory linear algebra course; senior or graduate standing. No prior knowledge of neuroscience is needed","title":"Neural Signal Processing"},{"courseId":"18721","treeType":"OR","nodeId":209,"isStarter":true,"prereqIndices":[210],"postreqIndices":[],"prereqLinks":[222],"postreqLinks":[],"description":"This course will familiarize students with advanced analog integrated circuit design issues. Analog circuit design issues play an important role in creating modern ICs. First and foremost, analog circuits act as the interface between digital systems and the real world. They act to amplify and filter analog signals, and to convert signals from analog to digital and back again. These analog interfaces appear in all communications devices (e.g., cell phones) ? both to condition the ?transmitted? signal and as sensitive ?receivers.? In addition, these analog interfaces appear in sensors (e.g., accelerometer). The goal of this course is to familiarize students with some of the advanced analog circuit design ideas that are involved in these tasks. Specific topics will include analog filtering (continuous-time and discrete-time), sample-and-hold amplifiers, analog-to-digital converters, digital-to-analog converters. Prerequisites: 18-623 (was 18-523 before Fall 2005) and senior or graduate standing.","title":"Advanced Analog Integrated Circuits Design"},{"courseId":"18623","treeType":"OR","nodeId":210,"isStarter":true,"prereqIndices":[],"postreqIndices":[209],"prereqLinks":[],"postreqLinks":[222],"description":"","title":""},{"courseId":"18731","treeType":"OR","nodeId":211,"isStarter":true,"prereqIndices":[212,213],"postreqIndices":[],"prereqLinks":[223,224],"postreqLinks":[],"description":"Some of today\u0027s most damaging attacks on computer systems involve exploitation of network infrastructure, either as the target of attack or as a vehicle to advance attacks on end systems. This course provides an in-depth study of network attack techniques and methods to defend against them. Topics include firewalls and virtual private networks; network intrusion detection; denial of service (DoS) and distributed denial-of-service (DDoS) attacks; DoS and DDoS detection and reaction; worm and virus propagation; tracing the source of attacks; traffic analysis; techniques for hiding the source or destination of network traffic; secure routing protocols; protocol scrubbing; and advanced techniques for reacting to network attacks. Prerequisite: 18-630 OR 18-730, and senior or graduate standing.","title":"Network Security"},{"courseId":"18630","treeType":"OR","nodeId":212,"isStarter":true,"prereqIndices":[],"postreqIndices":[211],"prereqLinks":[],"postreqLinks":[223],"description":"","title":""},{"courseId":"18730","treeType":"OR","nodeId":213,"isStarter":true,"prereqIndices":[],"postreqIndices":[211,214,215,216],"prereqLinks":[],"postreqLinks":[224,225,226,227],"description":"","title":""},{"courseId":"18732","treeType":"OR","nodeId":214,"isStarter":true,"prereqIndices":[213],"postreqIndices":[],"prereqLinks":[225],"postreqLinks":[],"description":"Poor software design and engineering are the root causes of most security vulnerabilities in deployed systems today. Moreover, with code mobility now commonplace--particularly in the context of web technologies and digital rights management--system designers are increasingly faced with protecting hosts from foreign software and protecting software from foreign hosts running it. This class takes a close look at software as a mechanism for attack, as a tool for protecting resources, and as a resource to be defended. Topics covered include the software design process; choices of programming languages, operating systems, databases and distributed object platforms for building secure systems; common software vulnerabilities, such as buffer overflows and race conditions; auditing software; proving properties of software; software and data watermarking; code obfuscation; tamper resistant software; and the benefits of open and closed source development. Prerequisites: 18-730; Skills in operating systems and programming languages (C and Java), and senior or graduate standing.","title":"Secure Software Systems"},{"courseId":"18733","treeType":"OR","nodeId":215,"isStarter":true,"prereqIndices":[213],"postreqIndices":[],"prereqLinks":[226],"postreqLinks":[],"description":"A wide array of communication and data protections employ cryptographic mechanisms. This course explores modern cryptographic (code making) and cryptanalytic (code breaking) techniques in detail. This course emphasizes how cryptographic mechanisms can be effectively used within larger security systems, and the dramatic ways in which cryptographic mechanisms can fall vulnerable to cryptanalysis in deployed systems. Topics covered include cryptographic primitives such as symmetric encryption, public key encryption, digital signatures, and message authentication codes; cryptographic protocols, such as key exchange, remote user authentication, and interactive proofs; cryptanalysis of cryptographic primitives and protocols, such as by side-channel attacks, differential cryptanalysis, or replay attacks; and cryptanalytic techniques on deployed systems, such as memory remanence, timing attacks, and differential power analysis. Prerequisites: 18-730 and senior or graduate standing.","title":"Applied Cryptography"},{"courseId":"18739","treeType":"OR","nodeId":216,"isStarter":true,"prereqIndices":[213],"postreqIndices":[],"prereqLinks":[227],"postreqLinks":[],"description":"Please go to the ECE website to view \u0026quot;Special Topics in Security\u0026quot; course descriptions. http://www.ece.cmu.edu/courses/index.html","title":"Special Topics in Security:"},{"courseId":"18745","treeType":"OR","nodeId":217,"isStarter":true,"prereqIndices":[218,219,221,222,223,224,225],"postreqIndices":[],"prereqLinks":[230,233,236,239,242,245,248],"postreqLinks":[],"description":"This is a project-oriented course which will deal with all four aspects of project development; the application, the artifact, the computer-aided design environment, and the physical prototyping facilities. The class, in conjunction with the instructors, will develop specifications for a mobile computer to assist in inspection and maintenance. The application will be partitioned between human computer interaction, electronics, industrial design, mechanical, and software components. The class will be divided into groups to specify, design, and implement the various subsystems. The goal is to produce a working hardware/software prototype of the system and to evaluate the user acceptability of the system. We will also monitor our progress in the design process by capturing our design escapes (errors) with the Orthogonal Defect Classification (ODC). Upon completion of this course the student will be able to: generate systems specifications from a perceived need; partition functionality between hardware and software; produce interface specifications for a system composed of numerous subsystems; use computer-aided design tools; fabricate, integrate, and debug a hardware/software system; and evaluate the system in the context of an end user application. This course is cross-listed as 18540.","title":"Rapid Prototyping of Computer Systems"},{"courseId":"","treeType":"AND","nodeId":218,"isStarter":true,"prereqIndices":[147,156],"postreqIndices":[217],"prereqLinks":[228,229],"postreqLinks":[230]},{"courseId":"","treeType":"AND","nodeId":219,"isStarter":true,"prereqIndices":[147,220],"postreqIndices":[217],"prereqLinks":[231,232],"postreqLinks":[233]},{"courseId":"18391","treeType":"OR","nodeId":220,"isStarter":true,"prereqIndices":[],"postreqIndices":[219,222,223,231],"prereqLinks":[],"postreqLinks":[232,238,241,258],"description":"","title":""},{"courseId":"","treeType":"AND","nodeId":221,"isStarter":true,"prereqIndices":[164,156],"postreqIndices":[217],"prereqLinks":[234,235],"postreqLinks":[236]},{"courseId":"","treeType":"AND","nodeId":222,"isStarter":true,"prereqIndices":[164,220],"postreqIndices":[217],"prereqLinks":[237,238],"postreqLinks":[239]},{"courseId":"","treeType":"AND","nodeId":223,"isStarter":true,"prereqIndices":[156,220],"postreqIndices":[217],"prereqLinks":[240,241],"postreqLinks":[242]},{"courseId":"","treeType":"AND","nodeId":224,"isStarter":true,"prereqIndices":[156,142],"postreqIndices":[217],"prereqLinks":[243,244],"postreqLinks":[245]},{"courseId":"","treeType":"AND","nodeId":225,"isStarter":true,"prereqIndices":[156,163],"postreqIndices":[217],"prereqLinks":[246,247],"postreqLinks":[248]},{"courseId":"18746","treeType":"OR","nodeId":226,"isStarter":true,"prereqIndices":[72],"postreqIndices":[],"prereqLinks":[249],"postreqLinks":[],"description":"This course covers the design, implementation, and use of storage systems, from the characteristics and operation of individual storage devices through the OS, database, and networking approaches involved in tying them together and making them useful to key applications\u0027 demands and technology trends. Topics to be covered include: network-attached storage, disk arrays, storage networking, storage management, advanced file systems, disk performance enhancement, wide-area data sharing, and storage security. 3 hrs. lec. Prerequisites: 15-410 or 15-412 and senior or graduate standing.","title":"Advanced Storage Systems"},{"courseId":"18748","treeType":"OR","nodeId":227,"isStarter":true,"prereqIndices":[147,164,44],"postreqIndices":[],"prereqLinks":[250,251,252],"postreqLinks":[],"description":"The use of distributed wireless sensor networks have surged in popularity in recent years with applications ranging from environmental monitoring, to people- and object-tracking in both cooperative and hostile environments. This course is targeted at understanding and obtaining hands-on experience with the state of the art in such wireless sensor networks which are often composed using relatively inexpensive sensor nodes that have low power consumption, low processing power and bandwidth. The course will span a variety of topics ranging from radio communications, network stack, systems infrastructure including QoS support and energy management, programming paradigms, distributed algorithms and example applications. Some guest lectures may be given. Each discussion-oriented lecture will be preceded by the reading of 1-2 papers, resulting in a rich collection of papers by the end of the semester. Early in the semester, hands-on exercises will be used to teach the programming of FireFly sensor nodes by using the \u0027nano-RK\u0027 power-aware sensor real-time operating system (RTOS) and using 802.15.4 radio communications. Then, project groups of no more than 3 students will define, design, implement and test a sensor network project. Final in-class project presentations will be supplemented by a written report. A final exam may be conducted to evaluate the students\u0027 understanding of the materials covered. Grading criteria will include classroom participation, course project content and report, and a final exam. Class size will be limited to 20 students or less. Hands-on experience with network programming, operating systems and assembly language are essential. Exceptions only with explicit permission of instructor. Prerequisites: 15-213 and ((18-348 or 18-349) or 15-410), and senior or graduate standing.","title":"Wireless Sensor Networks"},{"courseId":"18752","treeType":"OR","nodeId":228,"isStarter":true,"prereqIndices":[229],"postreqIndices":[],"prereqLinks":[253],"postreqLinks":[],"description":"Decision theory: Binary hypothesis testing, M-ary testing, Bayes, Neyman-Pearson, Min-Max. Performance. Probability of error, ROC. Estimation theory: linear and nonlinear estimation, parameter estimation. Bayes, MAP, maximum likelihood, Cram?r-Rao bounds. Bias, efficiency, consistency. Asymptotic properties of estimators. Orthogonal decomposition of random processes and harmonic representation. Waveform detection and estimation. Wiener filtering and Kalman-Bucy filtering. Elements of identification. Recursive algorithms. Spectral estimation. Topics may vary. 4 hrs. lec. Prerequisites: 18-751 and senior or graduate standing.","title":"Estimation, Detection and Identification"},{"courseId":"18751","treeType":"OR","nodeId":229,"isStarter":true,"prereqIndices":[],"postreqIndices":[228],"prereqLinks":[],"postreqLinks":[253],"description":"","title":""},{"courseId":"18753","treeType":"OR","nodeId":230,"isStarter":true,"prereqIndices":[57],"postreqIndices":[],"prereqLinks":[254],"postreqLinks":[],"description":"The first half of the course comprises of the concepts of entropy, mutual information, the Asymptotic Equipartition property, applications to source coding (data compression), applications to channel capacity (channel coding), differential entropy and its application to waveform channel capacities, and a subset of advanced topics such as network information theory, or rate-distortion theory, as time permits. The second half of the course comprises finite-field algebra, Hamming codes, cyclic codes (CRC and BCH codes), a brief introduction to Reed-Solomon codes, and perhaps universal codes (Lempel-Ziv coding). Prerequisites: 36-217 and senior or graduate standing.","title":"Information Theory"},{"courseId":"18759","treeType":"OR","nodeId":231,"isStarter":true,"prereqIndices":[232,220],"postreqIndices":[],"prereqLinks":[257,258],"postreqLinks":[],"description":"Wireless networks and wireless communications technology have the potential to make universal Internet use a reality, which will clearly lead to global connectivity, roaming, and ubiquitous communications. Given the astonishing increase in the number of Internet users (doubling every 90 days), this course aims to examine the relationship between the Internet and wireless networks. To that end, the emerging third generation (3G) wireless standards and how they accommodate data communications in addition to voice will be highlighted. While the emphasis will be on the networking issues and aspects of wireless communication networks, the relevant physical issues will briefly be reviewed as well. In addition, this year we will cover two hot topics as well: ad hoc wireless networks and ultra-wideband radio technology. The expectation is that the students completing this course will have a good idea about the role of wireless networks in the internet-centric future telecommunication networks. In addition, the course targets to train the students with the necessary set of skills (both analytical and qualitative) to do research on wireless networks. Prerequisites: (18-345 or 15-441) and 18-396 and (36-217 or 36-225 or 36-325)","title":"Wireless Networks"},{"courseId":"","treeType":"OR","nodeId":232,"isStarter":true,"prereqIndices":[62,143],"postreqIndices":[231],"prereqLinks":[255,256],"postreqLinks":[257]},{"courseId":"18760","treeType":"OR","nodeId":233,"isStarter":true,"prereqIndices":[14,138,156],"postreqIndices":[],"prereqLinks":[259,260,261],"postreqLinks":[],"description":"A large digital integrated circuit (IC) may require 100,000 lines of high-level description in a hardware modeling language, which then turns into 1,000,000 logic gates, which ultimately end up as 100 million polygons on the masks that define the IC. This course opens up the important CAD tools that perform the many steps of the transformation from Boolean equations to masks. We focus on mathematical models, algorithms, and data structures. We will write programs for simple versions of these tools. We will look at, and experiment with, a few real tools. We begin with a review of Boolean algebra, but from a computational viewpoint you don\u0027t see when you do Karnaugh maps by hand. We then move on to look at synthesis tools for 2-level and multi-level logic, that transform Boolean equations and finite state machine descriptions into optimized logic, and verification tools that decide whether the logic you built does the same thing as the specification you started with. We look at geometric layout synthesis tools for component partitioning, placement, and wire routing.We look at geometric layout verification tools that decide if you satisfied the manufacturing design rules, that extract back the circuit from all those polygons. Course grade is based on homework assignments (about 5-6), paper reviews (2), and projects (1-2 smaller warm-up projects, and then 1 significant group design project that allows creative input from the students.) 4 hrs. lec. Prerequisites: 18-240, 15-211 and 18-322 and senior or graduate standing.","title":"VLSI CAD: Logic to Layout"},{"courseId":"18764","treeType":"OR","nodeId":234,"isStarter":true,"prereqIndices":[156],"postreqIndices":[],"prereqLinks":[262],"postreqLinks":[],"description":"This course will provide the necessary background for the state-of-the art technologies utilized by the leading edge products covering full spectrum of market drivers from mobile platforms, microprocessors, game chips to the highest performance systems for enterprise solutions computing. We will cover the current planar CMOS technology generations as well as 3-dimensional FinFET device architectures. We will present all key components of such systems, i.e., logic, analog/RF and embedded memories (SRAM, DRAM and Flash). We will also cover the commodity DRAM and Flash memories (NOR and NAND). We will overview the underlying technology solutions, circuit design all the way to high level specifications including performance, power, area/form factors and cost. We will review architecture and technology solutions for all product classes described above. Then we present the technology roadmap for the upcoming generations in terms of device architecture options for logic devices (FinFET, Nanowire and Tunnel FET) and memories (Phase Change Memory , Resistive RAM and Magnetic RAM/Spin-Transfer Torque RAM) from the device level all the way to the system level specifications. The last part of the class will be devoted to the system integration issues, namely 3-dimensional integration approaches. We will cover the current SIP solutions and then focus on the interposer and Through Silicon Via (TSV) techniques covering such aspect as technology integration, power, performance, yield, cost and reliability. Prerequisites: 18-322 or 18-525, and senior or graduate standing.","title":"Technology Foundations and Roadmap for System on Chip and System in Package Prod"},{"courseId":"18765","treeType":"OR","nodeId":235,"isStarter":true,"prereqIndices":[14,138,236],"postreqIndices":[],"prereqLinks":[263,264,267],"postreqLinks":[],"description":"For this course, time- and topic-indexed videos of lecture, homework, projects, etc. will be available from the online learning portal/website. In addition to these resources, two 1-hour live sessions are scheduled per week for recitation. Each student is strongly urged to attend one of these two sessions each week, either remotely or in the classroom on the Carnegie-Mellon Pittsburgh campus. This course examines in depth the theory and practice of fault analysis, test generation, and design for testability for digital ICs and systems. The topics to be covered include circuit and system modeling; fault sources and types; the single stuck-line (SSL), delay, and functional fault models; fault simulation methods; automatic test pattern generation (ATPG) algorithms for combinational and sequential circuits, including the D-algorithm, PODEM, FAN, and the genetic algorithm; testability measures; design-for-testability; scan design; test compression methods; logic-level diagnosis; built-in self-testing (BIST); VLSI testing issues; and processor and memory testing. Advance research issues, including topics on MEMS and mixed-signal testing are also discussed. 4 hours of lecture per week Prerequisites: 18-240 and 15-211 and (18-340 or 18-341) Senior or graduate standing required.","title":"Digital System Testing and Testable Design"},{"courseId":"","treeType":"OR","nodeId":236,"isStarter":true,"prereqIndices":[163,142],"postreqIndices":[235],"prereqLinks":[265,266],"postreqLinks":[267]},{"courseId":"18791","treeType":"OR","nodeId":237,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Students will gain theoretical and practical skills in medical image analysis, including skills relevant to general image analysis. The fundamentals of computational medical image analysis will be explored, leading to current research in applying geometry and statistics to segmentation, registration, visualization, and image understanding. Student will develop practical experience through projects using the National Library of Medicine Insight Toolkit ( ITK ), a popular open-source software library developed by a consortium of institutions including Carnegie Mellon University and the University of Pittsburgh. In addition to image analysis, the course will include interaction with clinicians at UPMC. It is possible that a few class lectures may be videoed for public distribution. Prerequisites: Knowledge of vector calculus, basic probability, and either C++ or python. Required textbook, \u0026quot;Machine Vision\u0026quot;, ISBN: 052116981X; Optional textbook, \u0026quot;Insight to Images\u0026quot;, ISBN: 9781568812175.","title":"Methods in Medical Image Analysis"},{"courseId":"18795","treeType":"OR","nodeId":238,"isStarter":true,"prereqIndices":[139],"postreqIndices":[],"prereqLinks":[268],"postreqLinks":[],"description":"Bioimage Informatics (formerly Bioimaging) 12 units This course gives an overview of tools and tasks in various biological and biomedical imaging modalities, such as fluorescence microscopy, electron microscopy, magnetic resonance imaging, ultrasound and others. The major focus will be on automating and solving the fundamental tasks required for interpreting these images, including (but not restricted to) deconvolution, registration, segmentation, pattern recognition, and modeling, as well as tools needed to solve those tasks (such as Fourier and wavelet methods). The discussion of these topics will draw on approaches from many fields, including statistics, signal processing, and machine learning. As part of the course, students will be expected to complete an independent project. Prerequisites: 18-396 Signals and Systems","title":"Bioimage Informatics"},{"courseId":"18799","treeType":"OR","nodeId":239,"isStarter":true,"prereqIndices":[139],"postreqIndices":[],"prereqLinks":[269],"postreqLinks":[],"description":"Please go to the ECE Website to view \u0026quot;Special Topics in Signal Processing\u0026quot; course descriptions. http://www.ece.cmu.edu/courses/index.html","title":"Special Topics in Signal Processing"},{"courseId":"18819","treeType":"OR","nodeId":240,"isStarter":true,"prereqIndices":[135],"postreqIndices":[],"prereqLinks":[270],"postreqLinks":[],"description":"Please go the the ECE Website to view \u0026quot;Special Topics in Applied Physics\u0026quot; course descriptions. http://www.ece.cmu.edu/courses/index.html","title":"Special Topics in Applied Physics"},{"courseId":"18842","treeType":"OR","nodeId":241,"isStarter":true,"prereqIndices":[242,246],"postreqIndices":[],"prereqLinks":[277,281],"postreqLinks":[],"description":"The primary objective is to learn the fundamental principles underlying distributed systems, and apply some of this knowledge in developing a real system in a course project (such as a networked multimedia system or a groupware system with built-in mechanisms for supporting high availability). Topics include: models of distributed systems, distributed transactions, distributed filesystems, infrastructures for building distributed systems, distributed algorithms, cryptography and distributed security, an overview of distributed multimedia applications, systems and networking support for distributed multimedia systems, and distributed real-time systems. An intensive hands-on semester-long group project will be carried out to complement the concepts taught in the course.","title":"Distributed Systems"},{"courseId":"","treeType":"OR","nodeId":242,"isStarter":true,"prereqIndices":[44,243,244,245,147,164],"postreqIndices":[241],"prereqLinks":[271,272,273,274,275,276],"postreqLinks":[277]},{"courseId":"15412","treeType":"OR","nodeId":243,"isStarter":true,"prereqIndices":[],"postreqIndices":[242],"prereqLinks":[],"postreqLinks":[272],"description":"","title":""},{"courseId":"14342","treeType":"OR","nodeId":244,"isStarter":true,"prereqIndices":[],"postreqIndices":[242],"prereqLinks":[],"postreqLinks":[273],"description":"","title":""},{"courseId":"18342","treeType":"OR","nodeId":245,"isStarter":true,"prereqIndices":[],"postreqIndices":[242],"prereqLinks":[],"postreqLinks":[274],"description":"","title":""},{"courseId":"","treeType":"OR","nodeId":246,"isStarter":true,"prereqIndices":[143,247,248],"postreqIndices":[241],"prereqLinks":[278,279,280],"postreqLinks":[281]},{"courseId":"18756","treeType":"OR","nodeId":247,"isStarter":true,"prereqIndices":[],"postreqIndices":[246],"prereqLinks":[],"postreqLinks":[279],"description":"","title":""},{"courseId":"14740","treeType":"OR","nodeId":248,"isStarter":true,"prereqIndices":[],"postreqIndices":[246],"prereqLinks":[],"postreqLinks":[280],"description":"","title":""},{"courseId":"18843","treeType":"OR","nodeId":249,"isStarter":true,"prereqIndices":[44],"postreqIndices":[],"prereqLinks":[282],"postreqLinks":[],"description":"This is a course exploring research issues in the newly emerging field of mobile computing. Many traditional areas of computer science and computer engineering are impacted by the constraints and demands of mobility. Examples include network protocols, power management, user interfaces, file access, ergonomics, and security. This will be an \u0026quot;advanced\u0026quot; course in the truest sense --- most, if not all, the topics discussed will be ones where there is little consensus in the research community on the best approaches. The course will also offer significant \u0026quot;hand-on\u0026quot; experience in this area. Each student will have to present and lead the discussion on a number of papers. Students will work in groups of three under the guidance of a mentor on a hands-on project. Each student will also be required to write one of two documents: (a) a research proposal (similar in spirit to an NSF proposal) on an idea in mobile computing or (b) a short business plan for a commercial opportunity in mobile computing. Grading will be based on the quality of the presentations, the project, and the proposal or business plan. Prerequisites: 15-410 and senior or graduate standing.","title":"Mobile and Pervasive Computing"},{"courseId":"18845","treeType":"OR","nodeId":250,"isStarter":true,"prereqIndices":[72],"postreqIndices":[],"prereqLinks":[283],"postreqLinks":[],"description":"This course investigates the issues involved in providing scalable and highly available network services over the best-effort Internet. Examples of such services include Web servers, application servers, search engines, proxy caches, online auction systems, and remote visualization. Topics include network programming, server design, clustering, caching, proxies, remote execution, resource naming, discovery, and monitoring, and wide-area metacomputing. The course consists of lectures on existing technology, student presentations of research papers, and a project where students design and implement a significant network service. Prerequisites: 15-410 or 15-412 or 15-441, and senior or graduate standing.","title":"Internet Services"},{"courseId":"18869","treeType":"OR","nodeId":251,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Section D: Wild \u0026amp; Crazy Ideas in Electrical and Computer Engineering For a full course description please refer to the following webpage http://www.ece.cmu.edu/courses/18869D","title":"Special Topics in CAD"},{"courseId":"18875","treeType":"OR","nodeId":252,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"The course has two parts. The first part introduces basic components and networks used in the electric power industry. This is followed by systematic modeling of these components, as well as of the entire system. Methods for modeling and analyzing both system equilibria and dynamics are presented. Simulations and lab demos are given to simulate and analyze typical system blackouts. This is followed by introducing decision and control methods for preventing these problems, as well as for managing the system more reliably, securely and efficiently over broad ranges of its operating conditions. The emphasis is on IT, software and control (both distributed and coordination) for achieving pre-specified system performance. This part of the course will involve simulation demos and hands on studies in which students create their own power network, simulate it and assess for performance. The second part of the course will review the industry structure, the experience with deregulatio n, and economic issues concerning choice of generating fuel and technology, the costs of blackouts, and environmental discharges. The course will integrate engineering and economic aspects to examine the design, investment, and operations that satisfy public desires for low cost, nonpolluting, reliable, and secure power. Knowledge of basic electric circuits and/or basic economics is assumed. 3 hrs. lec., 1 hr. rec. Prerequisites: Basic electric circuits and/or basic economics and at least graduate standing.","title":"Engineering and Economics of Electric Energy Systems"},{"courseId":"18879","treeType":"OR","nodeId":253,"isStarter":true,"prereqIndices":[254,169,255],"postreqIndices":[],"prereqLinks":[284,285,286],"postreqLinks":[],"description":"Please go to the ECE Website to view \u0026quot;Special Topics in Systems and Controls\u0026quot; course descriptions. http://www.ece.cmu.edu/courses/index.html","title":"Special Topics in Systems and Controls"},{"courseId":"18470","treeType":"OR","nodeId":254,"isStarter":true,"prereqIndices":[],"postreqIndices":[253],"prereqLinks":[],"postreqLinks":[284],"description":"","title":""},{"courseId":"18372","treeType":"OR","nodeId":255,"isStarter":true,"prereqIndices":[],"postreqIndices":[253],"prereqLinks":[],"postreqLinks":[286],"description":"","title":""},{"courseId":"18902","treeType":"OR","nodeId":256,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Graduate Seminar"},{"courseId":"18980","treeType":"OR","nodeId":257,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"M.S. Graduate Project"},{"courseId":"18984","treeType":"OR","nodeId":258,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Full-time IMB students with graduate standing can apply to be IMB Teaching Assistants. IMB TAs work 10 hours a week and receive partial tuition reimbursement. MS IMB students must complete the online TA application to be considered for a position. See http://www.ece.cmu.edu/student/teaching.html for further information about the IMB TA program.","title":"M.S. Teaching Assistantship"},{"courseId":"18990","treeType":"OR","nodeId":259,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Reading and Research"},{"courseId":"18992","treeType":"OR","nodeId":260,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"Two semesters of Teaching Internship are required for the ECE Ph.D. program. Ph.D. students or M.S. students who intend to pursue a Ph.D. are eligible for the TI. Students should obtain their advisor\u0027s permission prior to applying for the TI. Students must complete the online TA application to be considered for a position. TIs are assigned to work 10 hours per week. Registration of 12 units is required for each semester of teaching. See http://www.ece.cmu.edu/student/teaching.html for further information about applying for a teaching internship position.","title":"ECE Graduate Teaching Internship"},{"courseId":"18994","treeType":"OR","nodeId":261,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Internship"},{"courseId":"18995","treeType":"OR","nodeId":262,"isStarter":true,"prereqIndices":[],"postreqIndices":[],"prereqLinks":[],"postreqLinks":[],"description":"","title":"Practicum in Electrical and Computer Engineering"},]